{
  "metadata": {
    "source_folder": "sopranos/",
    "processed_date": "2025-11-30T16:58:14.632189",
    "model_used": "claude-sonnet-4-20250514",
    "total_images": 56,
    "chapters_found": 0,
    "recipes_extracted": 87,
    "indexed_recipes": 85,
    "last_upsert": "2025-11-30T19:29:50.677404"
  },
  "chapters": [],
  "recipes": [
    {
      "name": "Sunday Gravy",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "Makes about 8 cups",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "2 tablespoons olive oil",
        "1 pound meaty pork neck bones or spareribs",
        "1 pound Italian sweet meat or veal shoulder chops",
        "1 pound Italian-style plain or fennel pork sausages",
        "4 garlic cloves",
        "1/4 cup tomato paste",
        "Three 28- to 32-ounce cans Italian peeled tomatoes",
        "Water",
        "Salt and freshly ground pepper",
        "6 fresh basil leaves, torn into small pieces"
      ],
      "sub_recipes": [
        {
          "name": "For the Sauce",
          "ingredients": [
            "2 tablespoons olive oil",
            "1 pound meaty pork neck bones or spareribs",
            "1 pound Italian sweet meat or veal shoulder chops",
            "1 pound Italian-style plain or fennel pork sausages",
            "4 garlic cloves",
            "1/4 cup tomato paste",
            "Three 28- to 32-ounce cans Italian peeled tomatoes",
            "Water",
            "Salt and freshly ground pepper",
            "6 fresh basil leaves, torn into small pieces"
          ]
        },
        {
          "name": "For the Meatballs",
          "ingredients": [
            "1 pound ground beef or a combination of beef and pork",
            "1/2 cup fine, dry bread crumbs, preferably homemade",
            "2 large eggs",
            "1 teaspoon very finely minced garlic",
            "1/3 cup freshly grated Pecorino Romano or Parmigiano-Reggiano",
            "3 tablespoons finely chopped fresh flat-leaf parsley",
            "Salt",
            "Freshly ground pepper",
            "2 tablespoons olive oil"
          ]
        },
        {
          "name": "To Serve",
          "ingredients": [
            "1 pound shells or rigatoni, cooked and still hot",
            "Freshly grated Pecorino Romano or Parmigiano-Reggiano"
          ]
        }
      ],
      "instructions": [
        "To make the sauce, heat the oil in a large heavy pot over medium heat. Pat the pork dry and pat the pieces with salt and pepper. Add the pork and brown it well on all sides, about 10 minutes. Set aside.",
        "Transfer the pork to a plate. Brown the veal in the same way and add it to the plate.",
        "Place the sausages in the pot and brown on all sides. Set the sausages aside with the pork.",
        "Drain off most of the fat from the pot. Add the garlic and cook for about two minutes or until golden. Remove and discard the garlic. Stir in the tomato paste and cook for 1 minute.",
        "Add the tomatoes with their juice. Using the side of a spoon, break up the tomatoes. Chop up the tomatoes and add them. Add the water and salt and pepper to taste. Add the pork, veal, and sausages and basil and bring the sauce to a simmer. Partially cover the pot and cook over low heat, stirring occasionally, for 2 hours. If the sauce becomes too thick, add a little more water.",
        "Meanwhile, make the meatballs.",
        "In a large bowl, mix together the beef, bread crumbs, eggs, garlic, cheese, and parsley. Add salt to taste, mixing gently and briefly. Form your hands with cold water and lightly shape the mixture into 2-inch balls. (Note: If you are making meatballs for lasagne or baked ziti, shape the meat into tiny balls the size of a small grape.)",
        "Heat the oil in a large heavy skillet. Add the meatballs and brown them well on all sides. (They will finish cooking later.) Transfer the meatballs to a plate.",
        "Add the meatballs to the sauce. Continue to cook 30 minutes or until the sauce is thick and the meats very tender.",
        "To serve, remove the meats from the sauce and set aside. Toss the cooked pasta with the sauce. Sprinkle with cheese. Serve the meats as a second course, or reserve them for another day."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:34:29_screenshot.png"
    },
    {
      "name": "Lasagne",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "Serves 8 to 10",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "Sunday Gravy (page 234) made with tiny meatballs",
        "About 2 strips (10 × 4 inches each) fresh egg pasta",
        "Salt",
        "2 pounds whole-milk ricotta",
        "1 pound fresh mozzarella, thinly sliced",
        "1 1/4 cups freshly grated Parmigiano-Reggiano or Pecorino Romano, or a combination"
      ],
      "sub_recipes": [],
      "instructions": [
        "Remove the meats, including the meatballs, from the gravy and set aside the pork and veal. Cut the sausages into thin slices and put them with the meatballs.",
        "Lay out some lint-free kitchen towels on a flat surface. Have a large bowl of cold water ready. Bring at least 4 quarts of water to a boil in a large pot. Add salt to taste. Add a few strips of the pasta and cook, stirring frequently, until tender but still slightly firm, about 2 to 3 minutes. Remove the pasta and plunge it into the cold water. When cool, lay the pasta sheets one flat on the towels. (The towels can be stacked one on top of the other.) Continue cooking and cooling the remaining lasagne in the same way.",
        "Preheat the oven to 350°F.",
        "Spread a thin layer of the sauce in a 13 × 9-inch baking pan. Set aside the best-looking pasta strips for the top layer. Arrange a layer of pasta, overlapping the pieces slightly. Spread about one-quarter of the ricotta on top of the pasta, then scatter on about one-quarter of the tiny meatballs and sliced sausages and one-quarter of the mozzarella. Spoon on about 1 cup more of the sauce and sprinkle with 1/4 cup of the grated cheese.",
        "Repeat the layers three more times. Make a final layer of pasta, sauce, and grated cheese. (If you have more than you need of any of the ingredients, reserve them. Cover tightly with plastic wrap and refrigerate until ready to bake, or as long as overnight.)",
        "Bake the lasagne for 1 hour and 10 to 20 minutes, until the top is browned and the sauce is bubbling around the edges. Let rest at least 10 to get hot browns on top before it is heated through, cover the pan loosely with aluminum foil.",
        "Remove the lasagne from the oven and let set for 15 minutes. Cut the lasagne into squares and serve."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:34:29_screenshot.png"
    },
    {
      "name": "Bistecca Pizzaiola",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "Serves 4",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": "Steak Pizzaiola-Style Pizzamaker's Style",
      "ingredients": [
        "2 tablespoons olive oil",
        "4 small tender steaks",
        "Salt and freshly ground pepper",
        "2 garlic cloves, finely chopped",
        "Salt and freshly ground pepper",
        "One 28-ounce can Italian peeled tomatoes, drained and chopped",
        "1/2 teaspoon dried oregano",
        "Pinch of crushed red pepper"
      ],
      "sub_recipes": [],
      "instructions": [
        "In a large skillet, heat the oil over medium heat. Pat the steaks dry. Add to the pan and cook, turning once, until browned on both sides. Sprinkle with salt and pepper. Transfer the meat to a platter.",
        "Scatter the garlic into the pan and cook for a minute. Add the tomatoes, oregano, red pepper, and salt to taste. Bring the sauce to a simmer. Cook for 20 minutes or until the sauce is thickened.",
        "Return the steaks to the sauce. Cook briefly, turning the steaks once or twice, until they are warmed and coated to taste. Serve hot."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:34:29_screenshot.png"
    },
    {
      "name": "Linguine alle Vongole",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "6",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": "Linguine with White Clam Sauce",
      "ingredients": [
        "3 pounds littleneck Manila, or other small hard-shell clams",
        "1/4 cup water",
        "1 pound linguine, lightly cooked",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "1 small dried peperoncino, crumbled, or a pinch of crushed red pepper",
        "1/3 cup extra virgin olive oil",
        "3 cloves of linguine",
        "Salt"
      ],
      "sub_recipes": [],
      "instructions": [
        "With a stiff brush, scrub the clams well under running water. Discard any clams that have broken shells or that don't close up tightly when lightly tapped.",
        "Place the clams in a large pot with the water. Cover the pot and turn the heat to medium-high.",
        "Cook just until the clams begin to open—you will hear a popping sound. Transfer the opened clams to a bowl and continue cooking the remaining clams. Discard any that refuse to open. Set the pot aside.",
        "Working over a small bowl to catch the juices, scrape the clams from the shells, placing them in another bowl. Discard the shells. Pour the clam juice back into the cooking pot.",
        "Rinse them out at a time in the clam juices. Pass the liquid through a sieve lined with cheesecloth or a paper coffee filter.",
        "In a 12-inch skillet, cook the garlic, parsley, and peperoncino in the oil over medium heat until the garlic is golden. Add about two-thirds of the clam juices and cook until the liquid is reduced by half. Remove the skillet from the heat and stir in the clams. Add salt if necessary.",
        "Meanwhile, bring at least 4 quarts of water to a boil in a large pot. Add the linguine and salt to taste. Cook, stirring frequently, until the linguine is al dente, tender yet still firm to the bite. Drain the pasta.",
        "Toss the pasta with the sauce over high heat for 1 minute. Serve immediately."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:34:40_screenshot.png"
    },
    {
      "name": "Polpetti in Salsa di Pomodoro",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "6",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": "Baby Octopus in Tomato Sauce",
      "ingredients": [
        "2 pounds baby octopus",
        "2 cups peeled and chopped fresh tomatoes or chopped canned Italian peeled tomatoes",
        "1/4 cup olive oil",
        "1/4 cup chopped fresh flat-leaf parsley",
        "2 large garlic cloves, finely chopped Pinch of crushed red pepper Salt",
        "6 to 10 Ficelle black pepper biscuits or slices toasted Italian bread"
      ],
      "sub_recipes": [],
      "instructions": [
        "Rinse the octopus and drain well. Remove the hard round beak at the base of the tentacles of each octopus.",
        "In a large heavy saucepan, combine the octopus, tomatoes, oil, 2 tablespoons of the parsley, the garlic, red pepper, and salt to taste. Bring sauce to a simmer. Cover the pot and cook over very low heat for 1 hour.",
        "Uncover the pan and cook for 15 minutes more, or until the octopus is tender when pierced with a knife and the sauce is thick.",
        "Sprinkle the breads with water to soften them slightly. Divide the breads, or slices of toast, among six plates. Top with the octopus and sauce. Sprinkle with the remaining 2 tablespoons parsley and serve."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:34:40_screenshot.png"
    },
    {
      "name": "Struffoli",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "any",
      "dish_role": "main",
      "serves": "12",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": "Honey Balls",
      "ingredients": [
        "About 1 1/2 cups all-purpose flour",
        "1/4 teaspoon salt",
        "3 large eggs",
        "1 tablespoon or so deep-frying",
        "1/2 cups honey",
        "Chopped candied orange peel and green candied cherries, multicolored candy sprinkles, or toasted sliced almonds"
      ],
      "sub_recipes": [],
      "instructions": [
        "In a large bowl, combine 1 cup of the flour and the salt. Add the eggs and oil until well blended. Turn the dough out onto a lightly floured board and knead until smooth, about 5 minutes; add a little more flour if the dough seems sticky.",
        "Shape the dough into a ball. Cover the dough with an overturned bowl. Let rest for 30 minutes.",
        "Cut the dough into 8 pieces. Roll one piece under your palms into a 1/2-inch-thick rope. Cut the rope into 1/2-inch pieces. Repeat with the remaining dough. Let the pieces dry for about 15 minutes, or handle—don't coat with flour, or the oil will foam up when you fry the struffoli.",
        "Pour about 2 inches oil into a deep heavy saucepan or a deep fryer. Heat the oil to 370°F on a deep-frying thermometer, or until a small bit of the dough dropped into the oil sizzles, swims rapidly around the pan, and turns brown in 1 minute.",
        "Add about one-third of the dough pieces. Do not overcrowd. Fry just enough of the pieces of dough into the pan as will fit without crowding. Cook, stirring once or twice, until the struffoli are crisp and evenly golden brown, 1 to 2 minutes. Remove the struffoli with a slotted spoon and drain on paper towels. Continue with the remaining dough.",
        "When all of the struffoli are fried, gently heat the honey just to a simmer in a large shallow saucepan. Remove from the heat, add the struffoli, and stir well. Pile the struffoli on a serving plate. Decorate with the candied fruits, sprinkles, or nuts.",
        "These keep well covered at room temperature for several days. To serve, break off portions of the struffoli with two large spoons or a salad server."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:35:05_screenshot.png"
    },
    {
      "name": "Pasta Fagioli",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "8",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": "Pasta Fazool Pasta and Beans",
      "ingredients": [
        "6 ounces (1 cup) diced cannellini or Great Northern beans or 3 cups canned beans, rinsed and drained",
        "1 celery rib, chopped",
        "2 garlic cloves, lightly crushed",
        "1/4 cup olive oil",
        "1 cup peeled, seeded, and chopped fresh tomatoes or canned Italian peeled tomatoes",
        "1/2 cup chopped flat-leaf parsley",
        "1/2 cup water",
        "1 small dried peperoncino, crumbled, or pinch of crushed red pepper Salt",
        "8 ounces ditalini or spaghetti or other pasta broken into 1-inch pieces"
      ],
      "sub_recipes": [],
      "instructions": [
        "If using dried beans, put them in a bowl with cold water to cover by 1 inch, and let stand for at least 6 hours, or overnight, in the refrigerator. Add more water if necessary to keep the beans covered.",
        "Drain the beans and place them in a pot with fresh water to cover by 1/2 inch. Bring to a simmer over low heat. Cover the pot and cook until the beans are very soft, about 1 hour. Add more water if needed to keep the beans just covered. (You can substitute 3 cups canned beans, rinsed and drained.) Puree about half of the beans with their liquid in a food processor, or mash them well. Return to the pot over moderate heat. When the garlic is golden, discard it. Add the tomatoes, tomato paste, water, peperoncino, and salt to taste. Simmer for 10 minutes, or until the sauce is slightly thickened.",
        "Add the beans and their cooking liquid, or the canned beans, to the tomato sauce. Bring the mixture to a simmer (mashing some of the beans with the back of a large spoon.",
        "Meanwhile, bring a large pot of salted water to a boil. Add the pasta and cook according to the package directions until al dente. Drain well and stir into the mixture.",
        "The mixture should be very thick, but add a little boiling water if it seems too thick. Turn off the heat and let stand for 10 minutes before serving."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:35:27_screenshot.png"
    },
    {
      "name": "Baccalà Pizzaiola",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "6 to 8",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": "Baccalà Pizzaiol Salt Cod Pizzamaker's Style",
      "ingredients": [
        "2 pounds baccalà (salt cod) or 1 1/2 pounds potatoes (stockfish)",
        "6 tablespoons olive oil",
        "2 large garlic cloves, very finely chopped",
        "3 cups peeled, seeded, and chopped fresh tomatoes or one 28- to 32-ounce can Italian peeled tomatoes, drained and chopped",
        "1/2 cup chopped flat-leaf parsley",
        "Salt and freshly ground pepper",
        "6 fresh basil leaves, torn into bits"
      ],
      "sub_recipes": [],
      "instructions": [
        "If using baccalà, place the fish in a large bowl with cold water to cover and place the bowl in the refrigerator to soak for 24 to 48 hours, changing the water every few hours, until the water no longer tastes salty.",
        "If using stockfish, soak the fish in the same manner for 4 to 7 days, until it is soft and pliable.",
        "Remove any bones or tough skin. Cut the fish into serving-size pieces. Pat them dry.",
        "In a large skillet, heat the oil over medium heat. Add the garlic and cook, stirring frequently, for 2 minutes, or until it is tender but not browning apart. Remove the fish with a slotted spoon. Let cool, then remove any skin and bones.",
        "Meanwhile, put 1/4 cup of the oil in a medium saucepan with the garlic and cook over medium heat until the garlic is lightly golden. Add the tomatoes and their juice, the oregano, and salt and pepper to taste. Bring to a simmer and cook, stirring occasionally, for about 20 minutes, or until thick.",
        "Stir in the basil.",
        "Preheat the oven to 400°F.",
        "Choose a baking dish large enough to hold the fish in a single layer. Spoon a thin layer of sauce into the dish. Arrange the fish on top. Spoon on the remaining sauce and drizzle with the remaining 2 tablespoons oil.",
        "Bake 30 minutes, or until the sauce is bubbling. Serve hot."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:35:27_screenshot.png"
    },
    {
      "name": "Rigatoni with Broccoli",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "4",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "1 bunch broccoli (about 1 1/4 pounds)",
        "Salt",
        "1/4 cup olive oil",
        "4 garlic cloves, thinly sliced",
        "Pinch of crushed red pepper",
        "8 ounces rigatoni",
        "1/2 cup freshly grated Pecorino Romano or Parmigiano-Reggiano"
      ],
      "sub_recipes": [],
      "instructions": [
        "Trim the broccoli and cut it into bite-sized pieces. Bring 4 quarts of cold water to a boil in a large pot. Add the broccoli and salt to taste. Cook for 2 minutes. Scoop out the broccoli with a small sieve. Reserve the cooking water in the pot.",
        "Pour the oil into a shallow large saucepan or enough to hold all the ingredients. Add the garlic and red pepper and sauté over medium heat for about 1 minute, or until the garlic is lightly golden. Add the broccoli and a pinch of salt. Cook, stirring occasionally, for 10 minutes, or until the broccoli is very soft.",
        "Meanwhile, bring the water back to a boil. Add the rigatoni and cook, stirring frequently, until the pasta is not quite tender. Scoop out about 1 cup of the cooking water and set it aside. Drain the rigatoni and add it to the skillet with the broccoli. Add the reserved cooking water and cook, stirring constantly, for about 1 minute, until the pasta absorbs most of the liquid.",
        "Sprinkle with the cheese, toss, and serve immediately."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:35:51_screenshot.png"
    },
    {
      "name": "Panzerotti",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "any",
      "dish_role": "main",
      "serves": "24",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": "Panzerotti Neapolitan Potato Croquettes. Makes about 24.",
      "ingredients": [
        "6 large boiling potatoes",
        "2 large eggs",
        "1 cup freshly grated Pecorino Romano or Parmigiano-Reggiano",
        "1/4 cup very finely chopped salami (about 2 ounces)",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "Pinch of ground nutmeg",
        "Salt and freshly ground pepper",
        "About 2 cups plain bread crumbs, preferably homemade",
        "Vegetable oil for shallow-frying"
      ],
      "sub_recipes": [],
      "instructions": [
        "Place the potatoes in a large saucepan with cold water to cover. Cover the pan, bring the water to a boil, and cook over medium heat for 20 minutes until the potatoes are tender when pierced with a fork. Peel the potatoes and mash them very, very fine. Let cool slightly.",
        "Stir the egg yolks, cheese, salami, parsley, and nutmeg into the potatoes. Add salt and pepper to taste.",
        "In a shallow dish, beat the egg whites until frothy. Spread the bread crumbs on a sheet of wax paper.",
        "Using about 1/4 cup of the potato mixture, form it into a sausage shape about 3 inch thick and 2 1/2 inches long. Repeat with the remaining potato mixture.",
        "Dip each panzerotti in the egg whites, letting the excess drip off, then roll in the crumbs, coating them completely. Place the logs on a wire rack and let dry for 10 to 20 minutes.",
        "Pour about 1/2 inch of oil into a large heavy skillet. Heat over medium heat until a bit of the egg white sizzles when dropped in the oil. Place only enough of the logs in the pan as will fit without crowding. Sauté at least 1/2 inch apart between them. Fry them, turning occasionally, until golden brown all over, about 8 minutes.",
        "Serve immediately, or keep them warm in a low oven while you fry the remainder."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:35:51_screenshot.png"
    },
    {
      "name": "Janice's Vegetarian Baked Ziti",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "6 to 8",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [
        "VEGETARIAN"
      ],
      "description": null,
      "ingredients": [
        "1 16-ounce package white mushrooms, trimmed",
        "1 large onion, chopped",
        "1/4 cup olive oil",
        "2 garlic cloves, chopped",
        "1 cup all-source cana tomato puree",
        "Salt and freshly ground pepper",
        "Salt and freshly ground pepper",
        "1 cup fresh or frozen peas",
        "1 lb ziti",
        "1 lb pasta",
        "1 cup freshly grated Pecorino Romano or Parmigiano-Reggiano",
        "1 cup ricotta",
        "8 ounces mozzarella, cut into small dice"
      ],
      "sub_recipes": [],
      "instructions": [
        "Place the mushrooms in a colander and rinse them quickly under cold running water. (Do not soak mushrooms, or they will absorb too much water.) Drain the mushrooms and pat dry. Slice the mushrooms 1/4 inch thick.",
        "To make the sauce, cook the onion in the oil in a large skillet until tender and golden. Stir in the garlic. Add the mushrooms and cook until the mushrooms are lightly browned, about 10 minutes. Add the tomato puree, basil, and salt and pepper to taste. Bring to a simmer and cook for 20 minutes. Stir in the peas.",
        "Meanwhile, bring at least 4 quarts of water to a boil in a large pot. Add the oil and salt to taste. Cook, stirring frequently, until the pasta is al dente, tender yet firm to the bite.",
        "Preheat the oven to 450°F and toss the ziti with the sauce. Add 1/2 cup of the grated cheese.",
        "Preheat the oven to 350°F.",
        "Spoon half the ziti into a shallow 3-1/2-quart baking dish. Spread the ricotta on top. Pour on a generous cup of the sauce and sprinkle with the mozzarella. Top with the remaining ziti, sauce, and more mozzarella. Sprinkle with the remaining grated cheese. (The ziti can be assembled ahead up to this point. Remove from the refrigerator about 30 minutes before baking.)",
        "Bake the ziti for 45 minutes. Uncover and bake for 15 to 30 minutes longer, or until the center is hot and the sauce is bubbling around the edges. Cover and let stand for 15 minutes before serving."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:36:42_screenshot.png"
    },
    {
      "name": "Chicken Soup With Orzo",
      "meal_type": "any",
      "dish_role": "main",
      "serves": "6",
      "prep_time": "",
      "cook_time": "",
      "calories": "",
      "protein": "",
      "carbs": "",
      "fat": "",
      "dietary_info": [],
      "ingredients": [
        "1 cut-up chicken",
        "2 pound chicken backs and wings",
        "2 medium carrots, chopped",
        "2 celery ribs, chopped",
        "2 onions, chopped",
        "1 cup fresh flat-leaf parsley",
        "6 whole black peppercorns",
        "Salt",
        "8 ounces orzo or other small pasta, cooked"
      ],
      "instructions": [
        "Rinse the chicken and chicken parts well. Set aside the giblets for another use. Place the chicken and chicken parts in a 6-quart pot. Add cold water to cover and bring to a simmer over medium heat. Reduce the heat to low and cook for 30 minutes. Skim off the foam and fat that rises to the surface.",
        "Add the vegetables, parsley, peppercorns, and a little salt. Simmer for 1 1/2 hours or until the chicken is tender. Add more water if needed to keep the chicken submerged.",
        "Remove the chicken. When it is cool enough to handle, remove and discard the skin and cut the chicken into bite-sized pieces. Return the meat to the pot. Reheat gently.",
        "Add the orzo, taste for seasoning, and serve hot."
      ],
      "tips": [],
      "source_image": "15:37:04_screenshot.png"
    },
    {
      "name": "Roasted Pepper Salad",
      "meal_type": "any",
      "dish_role": "side",
      "serves": "8",
      "prep_time": "",
      "cook_time": "",
      "calories": "",
      "protein": "",
      "carbs": "",
      "fat": "",
      "dietary_info": [],
      "ingredients": [
        "8 large red, yellow, or green bell peppers",
        "6 anchovy fillets, chopped",
        "6 fresh basil leaves, torn into pieces, or 1 teaspoon dried oregano",
        "2 garlic cloves, minced",
        "Salt and freshly ground pepper"
      ],
      "instructions": [
        "Cover the broiler pan with foil. Place the peppers on the pan and place in the broiler so that they are about 3 inches from the heat. Turn on the broiler to high. Roast the peppers, turning them frequently, until the skin blisters and they are charred all over. Put the peppers in a bowl, cover with foil, and let cool.",
        "Cut the peppers in half, draining the juices into a bowl. Peel off the skin and discard the seeds and stems. Cut the peppers lengthwise into 1-inch strips and place in a serving bowl. Strain the juices over the peppers.",
        "Add the olive oil, basil, garlic, and salt and pepper to taste. Let marinate for at least 30 minutes before serving."
      ],
      "tips": [],
      "source_image": "15:37:04_screenshot.png"
    },
    {
      "name": "Roast pork Shoulder",
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "8 to 10",
      "prep_time": "",
      "cook_time": "",
      "calories": "",
      "protein": "",
      "carbs": "",
      "fat": "",
      "dietary_info": [],
      "ingredients": [
        "8 garlic cloves",
        "1 tablespoon chopped fresh rosemary",
        "Salt",
        "1 teaspoon coarsely ground pepper",
        "Olive oil",
        "One 6-pound pork shoulder roast"
      ],
      "instructions": [],
      "tips": [],
      "source_image": "15:37:04_screenshot.png"
    },
    {
      "name": "Standing Rib Roast",
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "10",
      "prep_time": "",
      "cook_time": "",
      "calories": "",
      "protein": "",
      "carbs": "",
      "fat": "",
      "dietary_info": [],
      "ingredients": [
        "One 4-rib fully trimmed beef roast (about 8 pounds)",
        "Salt and freshly ground pepper",
        "2 medium carrots, cut into chunks",
        "2 onions, cut into wedges",
        "2 cups beef broth"
      ],
      "instructions": [
        "Preheat the oven to 325°F.",
        "Place the meat fat side up in a large roasting pan. Sprinkle it all over with salt and pepper. Scatter the carrots and onions around the meat.",
        "Place the roast in the lower third of the oven. Roast for 15 minutes to the pound for rare beef. An 8-pound roast will need about 2 hour and 15 minutes; the temperature of the meat should be 120° to 125°F on an instant-read thermometer.",
        "Remove the roast from the oven. (The USDA recommends cooking meat to 145°F, at which point it will be well-done.)",
        "Transfer the meat to a cutting board. Cover with foil and let stand for 20 to 30 minutes.",
        "Meanwhile, place the roasting pan on the stovetop over medium-high heat. Add the beef broth to the pan and stir, scraping up the browned bits at the bottom of the pan with a wooden spoon, for several minutes until slightly reduced. Strain the juices into a heated gravy boat.",
        "Carve the meat and serve with the juices."
      ],
      "tips": [],
      "source_image": "15:37:04_screenshot.png"
    },
    {
      "name": "Manicotti",
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "6 to 8",
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "ingredients": [
        "1 cup all-purpose flour",
        "1 cup water",
        "Salt",
        "1/2 teaspoon salt",
        "Vegetable oil",
        "4 large eggs",
        "2 pounds ricotta",
        "4 ounces fresh mozzarella, chopped or shredded",
        "1/4 cup freshly grated Parmigiano-Reggiano or Pecorino Romano",
        "1 large egg",
        "Salt and freshly ground fresh black pepper",
        "Pinch of salt",
        "Freshly ground pepper",
        "Marinara Sauce (page 13) or Sunday Gravy (page 14)",
        "1/4 cup freshly grated Parmigiano-Reggiano or Pecorino Romano"
      ],
      "sub_recipes": [],
      "instructions": [
        "To make the crepes, in a large bowl, whisk together the ingredients until smooth. Cover and refrigerate for at least 30 minutes.",
        "Heat a 6-inch nonstick skillet or omelet pan over medium heat. Brush the pan lightly with oil.",
        "Holding the pan in one hand, spoon in about 1/4 cup of the crepe batter and immediately rotate and tilt the pan so that the batter coats the bottom evenly. Return the pan to the heat and cook for a minute, or until the edges turn brown and begin to lift away from the pan. With your fingers, flip the crepe over and cook for 30 seconds more, or until spotted with brown on the other side.",
        "Transfer to a plate. Repeat with the remaining crepe batter. Cover with a piece of wax paper. Repeat with the remaining batter, stacking the cooked crepes and separating each one with a piece of wax paper. (The crepes can be made up to 2 days in advance, covered, and refrigerated. Bring to room temperature before using.)",
        "Preheat the oven to 350°F.",
        "Meanwhile, combine all of the ingredients in a large bowl.",
        "Spoon a thin layer of the sauce into a 13 × 9 × 2-inch baking dish. Place about 1/4 cup of the filling lengthwise down the center of a crepe, roll it up, and place it seam side down in the dish. Continue with the remaining crepes and filling, placing them close together. Spoon on the remaining sauce. Sprinkle with the cheese.",
        "Bake for 25 to 30 minutes, or until the sauce is bubbling and the manicotti are heated through. Serve hot."
      ],
      "tips": [
        "Lightly dust a large cookie sheet with flour and pieces at a time, keeping the remainder covered. On a lightly floured surface, work with one piece at a time and roll into a 1/2-inch-thick rope. Cut the rope into 1/2-inch pieces.",
        "Using a small knife with a dull blade and rounded tip, press your index finger against the edge of the blade and flatten each piece of dough, pressing and dragging it slightly so that the dough curls around the tip of the knife to form a shell shape.",
        "Spread the cavatelli on a prepared cookie sheet. Repeat with the remaining dough.",
        "(If you are not using the cavatelli within an hour, place the pasta in the freezer. When the pieces are firm, scoop them into a plastic bag and seal tightly. Frozen until ready to use. Do not thaw before cooking.)",
        "To cook the cavatelli, bring at least 4 quarts of water to a boil in a large pot over high heat. Add the cavatelli and salt to taste. Cook, stirring occasionally, until the pasta is tender yet still firm to the bite and slightly chewy.",
        "Meanwhile, reheat the sauce.",
        "Drain the cavatelli and toss them into a heated serving bowl. Add the sauce and serve immediately, with grated cheese."
      ],
      "source_image": "15:37:28_screenshot.png"
    },
    {
      "name": "Amaretti",
      "meal_type": "any",
      "dish_role": "main",
      "serves": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "ingredients": [
        "One 8-ounce can almond paste",
        "1 cup sugar",
        "2 large egg whites, at room temperature",
        "30 red or green candied cherries or whole almonds"
      ],
      "sub_recipes": [],
      "instructions": [
        "Preheat the oven to 350°F. Line two large baking sheets with parchment paper or foil.",
        "In a food processor or in the large bowl of an electric mixer, combine the almond paste and sugar. Process or beat until blended, add the egg whites, and process or beat until very smooth.",
        "Scoop up tablespoons of the batter and lightly roll it into a ball. Transfer your hands with cool water if the mixture becomes sticky. Place on a prepared baking sheet, leaving 1 inch between the remaining batter, placing the balls about 1 inch apart on the baking sheets. Push a candied cherry or almond into the top of each cookie.",
        "Bake for 12 to 15 minutes, or until the cookies are lightly browned. Let cool briefly on the baking sheets. With a thin metal spatula, transfer the cookies to wire racks to cool completely.",
        "Store the cookies in airtight containers."
      ],
      "tips": [],
      "source_image": "15:37:28_screenshot.png"
    },
    {
      "name": "Biscotti Regina",
      "meal_type": "any",
      "dish_role": "main",
      "serves": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "ingredients": [
        "1/2 cup milk",
        "2 cups unbleached sesame seeds",
        "4 cups all-purpose flour",
        "1 cup sugar",
        "3 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1/2 pound (2 sticks) unsalted butter, cut into pieces and softened",
        "3 large eggs, at room temperature",
        "2 teaspoons vanilla",
        "1 teaspoon grated orange zest"
      ],
      "sub_recipes": [],
      "instructions": [
        "Preheat the oven to 375°F. Butter and flour two large baking sheets.",
        "Pour the milk into a shallow bowl. Spread the sesame seeds on a piece of wax paper. Set aside.",
        "In the large bowl of an electric mixer, combine the flour, sugar, baking powder, and salt. On"
      ],
      "tips": [],
      "source_image": "15:37:28_screenshot.png"
    },
    {
      "name": "Cavatelli",
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "6 to 8",
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "ingredients": [
        "2 cups fine semolina flour",
        "1 cup all-purpose flour, plus more for dusting",
        "Salt",
        "About 1 cup warm water",
        "Sunday Gravy (page 14) or a double recipe of Marinara Sauce (page 13)",
        "Freshly grated Parmigiano-Reggiano or Pecorino Romano for serving"
      ],
      "sub_recipes": [],
      "instructions": [
        "Stir together the two flours and 1 teaspoon salt in a bowl. Gradually add enough water to form a soft dough. Turn the dough out onto a lightly floured surface. Knead the dough until it is smooth, about 5 minutes. Cover the dough with plastic wrap and let it rest at least 30 minutes."
      ],
      "tips": [],
      "source_image": "15:37:28_screenshot.png"
    },
    {
      "name": "Biscotti",
      "meal_type": "any",
      "dish_role": "main",
      "serves": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "ingredients": [
        "2 cups flour",
        "1 cup sugar",
        "3 eggs",
        "1/2 cup butter",
        "2 teaspoons baking powder",
        "1 teaspoon vanilla extract",
        "1 cup almonds or other nuts"
      ],
      "sub_recipes": [],
      "instructions": [
        "Beat eggs, beat in the butter a little at a time.",
        "In another bowl, break the eggs, vanilla, and orange zest. Stir the egg mixture into the dry mixture until well blended.",
        "Pinch off a piece of dough the size of a golf ball and shape it into a log 2 1/2 inches long and 3/4 inch thick.",
        "Place logs on greased baking sheets about 2 inches apart. Bake for 25 to 30 minutes, or until well browned. Let cool on the baking sheets for 10 minutes, then transfer the cookies to a rack to cool completely. Store in an airtight container."
      ],
      "tips": [],
      "source_image": "15:37:38_screenshot.png"
    },
    {
      "name": "Ricotta-Pineapple Pie",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "any",
      "dish_role": "main",
      "serves": "8",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "1 tablespoon unsalted butter, softened",
        "1/4 cup fine graham cracker crumbs",
        "1 cup ricotta cheese",
        "3 tablespoons cornstarch",
        "One 15-ounce container ricotta",
        "2 large eggs",
        "1/2 cup heavy cream",
        "1/4 cup sweetened lemon zest",
        "1 teaspoon vanilla extract"
      ],
      "sub_recipes": [
        {
          "name": "For the Topping",
          "ingredients": [
            "One 20-ounce can crushed pineapple in syrup",
            "1/4 cup sugar",
            "3 tablespoons cornstarch",
            "2 teaspoons fresh lemon juice"
          ]
        }
      ],
      "instructions": [
        "Preheat the oven to 350°F. Grease a 9-inch pie pan and butter over the bottom and sides of a 9-inch pie pan or springform pan. Add the crumbs, turning the pan to coat the bottom and sides.",
        "In a large bowl, stir together the ricotta and cornstarch. Add the ricotta, eggs, cream, lemon zest, and vanilla and beat until smooth. Pour the mixture into the prepared pan.",
        "Bake for 30 minutes, or until the pie is set around the edges but the center is still slightly soft. Cool completely on a wire rack.",
        "To make the topping, drain the pineapple well, reserving 1/4 cup of the liquid. In a medium saucepan, stir together the sugar and cornstarch. Stir in the 1/4 cup pineapple juice and the lemon juice. Cook, stirring, until thickened, about 1 minute. Add the pineapple. Remove from the heat and let cool slightly.",
        "Spoon the pineapple mixture over the pie. Cover and chill for at least 1 hour before serving."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:38:13_screenshot.png"
    },
    {
      "name": "Minestra",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "6",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": "Mussels Escarole and Little Meatballs Soup",
      "ingredients": [
        "2 pounds mussels (about 1 pound)",
        "6 quarts chicken broth, preferably homemade",
        "3 large carrots, chopped"
      ],
      "sub_recipes": [
        {
          "name": "For the Meatballs",
          "ingredients": [
            "1 pound ground veal or beef",
            "1 large egg",
            "1/2 cup very finely minced onion",
            "1 cup plain bread crumbs",
            "1 cup freshly grated Parmigiano-Reggiano",
            "1 teaspoon salt",
            "Pinch of freshly ground pepper to taste",
            "8 ounces dittalini or tubetti, or spaghetti broken into bite-sized pieces",
            "Freshly grated Parmigiano-Reggiano"
          ]
        }
      ],
      "instructions": [
        "Trim the escarole and discard any bruised leaves. Cut off the stem ends. Separate the leaves and wash well in cool water, especially the center of the leaves where grit collects. Stack the leaves and cut them crosswise into 1-inch strips. You should have about 4 cups.",
        "In a large pot, combine the escarole, broth, and carrots. Bring to a simmer and cook until the escarole is almost tender, about 30 minutes.",
        "Meanwhile, mix together all of the meatball ingredients. Shape the mixture into tiny balls, less than 1/2 inch in diameter.",
        "When the escarole is cooked, stir in the pasta and return the soup to the simmer. Drop the meatballs into the soup. Cook over low heat, stirring gently, until the meatballs and pasta are cooked, about 20 minutes. Taste for seasoning.",
        "Serve hot with grated Parmigiano."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:38:13_screenshot.png"
    },
    {
      "name": "Rigatoni with Sweet Sausage and Tomato Sauce",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "6",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "1 pound plain Italian-style pork sausages",
        "4 tablespoons olive oil",
        "2 garlic cloves, finely chopped",
        "1/2 cup dry white wine",
        "3 pounds plum tomatoes, peeled, seeded, and chopped, or one 28- to 35-ounce can Italian peeled tomatoes, passed through a food mill",
        "Salt and freshly ground black pepper",
        "3 or 4 fresh basil leaves, torn into bits",
        "1 pound rigatoni",
        "1/2 cup freshly grated Pecorino Romano"
      ],
      "sub_recipes": [],
      "instructions": [
        "Remove the sausage from the casings. Chop the meat fine.",
        "In a large pot, heat the oil over medium heat. Add the sausage and garlic and cook, stirring frequently, until the sausage is lightly browned. Add the wine and bring to a simmer. Cook until most of the wine evaporates.",
        "Stir in the tomatoes and salt and pepper to taste. Bring to a simmer. Reduce the heat to low and cook, stirring occasionally, until the sauce is thickened, 1 hour and 15 to 30 minutes. Stir in the basil.",
        "Meanwhile, bring at least 4 quarts of water to a boil in a large pot over high heat. Add the rigatoni and salt to taste. Cook, stirring occasionally until the rigatoni is al dente, tender yet still firm to the bite. Drain.",
        "In a large heated serving bowl, toss the rigatoni with the sauce. Serve with the grated cheese."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:38:20_screenshot.png"
    },
    {
      "name": "Scarole with Garlic",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "any",
      "dish_role": "side",
      "serves": "4",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": "Sautéed Escarole",
      "ingredients": [
        "1 head escarole (about 1 pound)",
        "3 tablespoons olive oil, thinly sliced",
        "Pinch of crushed red pepper (optional)",
        "3 tablespoons olive oil",
        "Salt"
      ],
      "sub_recipes": [],
      "instructions": [
        "Trim the escarole and discard any bruised leaves. Cut off the stem ends. Separate the leaves and wash well in cool water, especially the center of the leaves where soil collects. Stack the leaves and cut them into bite-sized pieces.",
        "In a large pot, heat the oil over medium. Add the garlic and red pepper if using in the olive oil over medium heat until the garlic is golden. Add the escarole and salt to taste. Stir well. Cover the pot and cook until the escarole is tender, about 15 minutes.",
        "Serve hot or at room temperature."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:38:20_screenshot.png"
    },
    {
      "name": "Baked Chicken with Potatoes, Lemon, and Oregano",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "4",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "2 lemons",
        "1 chicken (about 3 1/2 pounds), quartered",
        "3 potatoes, peeled and cut into pieces",
        "1 tablespoon olive oil",
        "1 teaspoon dried oregano",
        "3 tablespoons butter",
        "Salt and freshly ground pepper"
      ],
      "sub_recipes": [],
      "instructions": [
        "Preheat the oven to 450°F.",
        "Squeeze the juice from 1 lemon. Slice the other one.",
        "Put the chicken and potatoes in a baking pan large enough to hold them in a single layer. Sprinkle with the lemon juice, oil, oregano, garlic, and salt and pepper to taste. Turn the pieces to coat evenly, then turn the chicken skin side up. Tuck the lemon slices and potatoes in between the chicken pieces.",
        "Put the butter into small pieces and distribute it over the chicken and potatoes. Bake, turning occasionally, for 45 to 50 minutes longer, or until the chicken is browned and the potatoes are tender.",
        "Transfer the chicken, potatoes, and lemon slices to a serving platter. Tip the pan and skim off the fat. Pour the juices over the chicken and serve."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:38:28_screenshot.png"
    },
    {
      "name": "Mom's Pear and Grappa Pound Cake",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "any",
      "dish_role": "main",
      "serves": "12",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": "One December our pear halves for dessert",
      "ingredients": [
        "3 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1/2 teaspoons salt",
        "1/3 pound (5 sticks) unsalted butter, softened",
        "1 1/2 cups sugar",
        "5 large eggs",
        "3 tablespoons grappa, rum, or brandy",
        "1 teaspoon vanilla extract",
        "Confectioners' sugar"
      ],
      "sub_recipes": [],
      "instructions": [
        "Preheat the oven to 350°F. Butter and flour a 10-inch Bundt pan or tube pan.",
        "Drain the pears and reserve the liquid. Chop the pears into 1/2-inch pieces. You should have about 1 1/4 cups pears and 1/2 cup liquid.",
        "In a medium bowl, stir together the flour, baking powder, and salt.",
        "In a large bowl, with an electric mixer, cream the butter and sugar on medium speed until light and fluffy, about 5 minutes. Add the eggs one at a time, beating well after each addition. Beat in the reserved pear liquid, the grappa, and vanilla. (The batter will look curdled.)",
        "Reduce the speed to low. Add the flour mixture, scraping the sides of the bowl as necessary and beating just until blended, about 1 minute. With a rubber spatula, stir in the pears.",
        "Scrape the batter into the prepared pan and smooth the top. Bake on the center or lower third of the oven rack on a wire rack for 10 minutes. Cool in the pan on a wire rack for 10 minutes.",
        "Invert the cake onto a rack and remove the pan. Let cool completely.",
        "Sprinkle with confectioners' sugar before serving."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:38:28_screenshot.png"
    },
    {
      "name": "Fettuccine Primavera",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "6",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "4 tablespoons unsalted butter",
        "1 large onion, chopped coarse",
        "2 medium carrots, peeled and finely diced",
        "1 cup broccoli florets (cut into 1/4-inch pieces)",
        "1 cup asparagus tips",
        "1/2 cup fresh or frozen peas",
        "2 teaspoons minced garlic",
        "Salt and freshly ground pepper",
        "10 basil leaves, stacked and cut into thin ribbons",
        "1 pound fresh fettuccine",
        "3/4 cup freshly grated Parmigiano-Reggiano"
      ],
      "sub_recipes": [],
      "instructions": [
        "Bring at least 4 quarts of water to a boil in a large pot. Add salt to taste. Add the broccoli and asparagus and cook for 1 minute. With a small ladle, scoop out the vegetables and drain them well. Leave the water boiling in the pot.",
        "In a skillet large enough to hold the cooked fettuccine, melt the butter over medium heat. Add the onions and carrots and cook, stirring occasionally, for 5 minutes, or until softened.",
        "Add the broccoli and asparagus to the skillet, along with the peas and cream. Bring to a simmer. Season to taste with salt and pepper. Stir in the basil and turn off the heat.",
        "Drop the fettuccine into the boiling water and cook, stirring frequently, until al dente, tender yet still firm to the bite. Drain the fettuccine and add it to the skillet. Add the cheese and toss well. Serve immediately."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:39:25_screenshot.png"
    },
    {
      "name": "Tortellini in Brodo",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "8",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "2 tablespoons butter",
        "4 ounces boneless pork loin, cut into 1-inch cubes",
        "4 ounces veal, cubed",
        "4 ounces mortadella",
        "1 cup freshly grated Parmigiano-Reggiano",
        "1 large egg",
        "1/4 teaspoon freshly ground nutmeg"
      ],
      "sub_recipes": [],
      "instructions": [],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:39:25_screenshot.png"
    },
    {
      "name": "Ravioli alla Bucco",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "8",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "3 large eggs, beaten",
        "1/4 cup cool water",
        "1 teaspoon salt",
        "About 3 cups all-purpose flour",
        "1 pound whole-milk ricotta",
        "4 ounces fresh mozzarella, coarsely grated or very finely chopped",
        "3 ounces Romano cheese, grated",
        "1 large egg",
        "1/2 cup freshly grated Parmigiano-Reggiano",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "Salt and freshly ground pepper to taste",
        "2 pounds Osso Bucco (see recipe page 147)",
        "Sunday Gravy (page 14) or double recipe Marinara Sauce (page 15)",
        "1 cup freshly grated Parmigiano-Reggiano"
      ],
      "sub_recipes": [],
      "instructions": [
        "To make the pasta, put the eggs, water, and oil in a food processor or the bowl of a heavy-duty mixer. Gradually add about 2 1/2 cups flour and mix until the dough forms a ball. Stop the machine and feel the dough; it should be moist but not sticky. Add more flour if needed.",
        "Transfer the dough to a lightly floured surface, knead the dough for about 4 minutes until it feels firm and smooth and springs back when pressed with a finger, about 10 minutes.",
        "To make the filling, mix together all of the ingredients in a bowl. Cover and refrigerate until ready to use.",
        "Use 2 or 3 large baking sheets with lint-free towels. Dust the towels with flour.",
        "Cut the dough into 8 pieces. Work with one piece at a time, leaving the remaining pieces covered. Shape the piece of dough into a flat disk. Lightly dust the rollers of a pasta machine with flour and set the machine to the widest setting (#1). Pass the dough through the machine. Change to the next-thinner setting and pass the dough through the machine. Continue to pass the dough through each successive setting until it is very thin and you reach the last or second-to-the-last setting, depending on your pasta machine. If the dough sticks or tears, dust it with flour, fold it, and pass it through the machine again."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:39:42_screenshot.png"
    },
    {
      "name": "Calamari Ripieni",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "6 to 8",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": "Stuffed Calamari",
      "ingredients": [
        "2 1/2 pounds cleaned large calamari (squid)",
        "1/4 cup olive oil",
        "1 garlic clove, minced",
        "1/2 cup plain bread crumbs",
        "3 tablespoons chopped fresh flat-leaf parsley",
        "2 tablespoons chopped Gaeta olives",
        "2 tablespoons pine nuts"
      ],
      "sub_recipes": [],
      "instructions": [
        "Lay the strips of dough on a lightly floured surface. Fold it lengthwise in half to mark the center, then unfold it. Beginning about 1 inch from one end of the short sides, place teaspoonfuls of the filling about 1 inch apart in a straight row down one side of the fold. Lightly brush around the mounds of filling with the beaten egg, then fold the dough over the filling to cover completely and press down. Use a fluted pastry wheel or a sharp knife to cut between the mounds of filling. Separate the ravioli, and press the edges firmly with a fork to seal. Place the ravioli in a single layer on a parchment-lined baking sheet.",
        "Repeat with the remaining dough and filling. Cover the ravioli with a towel and refrigerate until you're ready, or up to 8 hours, bringing the pieces together from to boil they do not stick to the fronds. (To store them longer, freeze the ravioli on the baking sheets until firm. Transfer them to a heavy-duty plastic bag, seal tightly, and store in the freezer for up to 1 month. Do not thaw before cooking.)",
        "Bring at least 4 quarts of water to a boil in a large pot. Lower the heat under the pasta pot so that the water boils gently. Add the ravioli and salt to taste. Cook until tender, 2 to 3 minutes depending on their thickness. With a large slotted spoon or skimmer, lift the ravioli from the water and drain over low heat. Pour some of the sauce into a heated serving bowl.",
        "Scoop the ravioli out of the pot with a new and drain well. Place the ravioli in the serving bowl. Pour on the remaining sauce. Sprinkle with the cheese and serve immediately."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:40:05_screenshot.png"
    },
    {
      "name": "Osso Buco a la Bucco",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "4",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "4 meaty shank veal shanks, about 1 1/2 inches thick",
        "2 tablespoons veal fond butter",
        "1 tablespoon olive oil",
        "Salt and freshly ground pepper",
        "1/4 cup all-purpose flour",
        "1/2 cup dry white wine",
        "1 cup peeled, seeded, and chopped fresh tomatoes or chopped canned Italian peeled tomatoes",
        "1 cup chicken broth or meat broth",
        "2 garlic cloves, finely chopped",
        "1 tablespoon chopped fresh flat-leaf parsley",
        "1 teaspoon grated lemon zest"
      ],
      "sub_recipes": [],
      "instructions": [
        "Spread the flour on a piece of wax paper. Dredge the veal in the flour, shaking off the excess. In a Dutch oven with a tight-fitting lid, melt the butter with the oil over medium heat. Add the seasoned veal and cook, turning once, until golden brown on both sides, about 10 minutes. Season with salt and pepper. Scatter the onion around the meat. Cook until the onion is tender, about 10 minutes. Add the wine and cook, scraping the bottom of the pan with a wooden spoon. Stir in the tomatoes and broth and bring to a simmer. Partially cover the pan and cook, basting the meat occasionally, with the sauce, for 1 1/2 hours or until the veal is tender and coming away from the bone. If there is too much liquid, uncover the pan for the last 15 minutes of cooking.",
        "Meanwhile, about 5 minutes before serving, chop together the garlic, parsley, and lemon zest. Stir the lemon zest mixture into the sauce in the pan and baste the meat. Serve immediately."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:40:05_screenshot.png"
    },
    {
      "name": "Quail Sinatra-Style",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "4 to 6",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "8 fresh or thawed frozen quail",
        "Salt and freshly ground pork sausage",
        "2 tablespoons very finely chopped sun-dried tomatoes",
        "1 cup dry white wine",
        "1 tablespoon chopped fresh rosemary"
      ],
      "sub_recipes": [],
      "instructions": [],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:40:05_screenshot.png"
    },
    {
      "name": "Chicken Scarpariello",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "6",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "1 pound Italian-style pork sausages",
        "1/4 cup olive oil",
        "1 chicken (about 3 pounds), cut into 16 pieces",
        "Salt and freshly ground pepper",
        "6 large cloves, thinly sliced",
        "1/4 cup pickled cherry peppers",
        "1 cup pickled sweet peppers, cut into bite-sized pieces",
        "1/4 cup white wine vinegar or pickling liquid from the peppers"
      ],
      "sub_recipes": [],
      "instructions": [
        "Place the sausages in a medium skillet and prick them all over with a fork. Add cold water to come halfway up the sausages. Cover the pan, place over medium heat, and cook until the water has evaporated and the sausages are cooked through. Uncover and cook until browned all over. Cut the sausages into 1-inch pieces.",
        "In a skillet large enough to hold all of the chicken in a single layer, heat the oil over medium heat."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:40:23_screenshot.png"
    },
    {
      "name": "Chicken Francese",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "4",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": "Pat the chicken pieces dry and place them in the brine. Sprinkle with salt and pepper. Cook, stirring occasionally, until golden, about 10 minutes. Add the garlic and cook for 3-4 minutes more. Add the wine and scrape up any browned bits, then add the tomatoes. Lower the heat to low and cook, stirring often, for 10 to 15 minutes, or until the liquid is reduced to a light glaze. Serve immediately.",
      "ingredients": [
        "4 pound thin-sliced chicken cutlets",
        "Salt and freshly ground pepper",
        "2 large eggs",
        "1/2 cup all-purpose flour",
        "1/2 cup chicken broth",
        "1/4 cup dry white wine",
        "2 tablespoons fresh lemon juice (to taste)",
        "3 tablespoons olive oil",
        "3 tablespoons unsalted butter",
        "1 tablespoon chopped fresh flat-leaf parsley",
        "Lemon wedges"
      ],
      "sub_recipes": [],
      "instructions": [
        "Place the chicken cutlets between two sheets of plastic wrap. With a meat pounder or mallet, gently pound the slices to about a 1/4-inch thickness. Sprinkle the chicken generously with salt and pepper.",
        "Beat the eggs in a shallow bowl, season with salt and pepper, and beat until well blended. Spread the flour on a plate. Mix together the broth, wine, and lemon juice in a measuring cup or bowl.",
        "Heat the oil with the butter in a large skillet over medium heat until sizzling. Dip only enough of the cutlets in the flour as will fit in the pan in a single layer, dip them in the egg, and add to the pan. Cook, turning once, until golden brown on both sides, 4 to 5 minutes total. Don't overcook and don't let the cutlets stick.",
        "Transfer the chicken to a plate and keep it warm. Repeat with the remaining chicken.",
        "When all of the chicken is done, add the broth mixture to the pan. Raise the heat and cook, scraping the bottom of the pan, until the sauce is slightly thickened. Stir in the parsley.",
        "Return the chicken pieces to the skillet and turn them over to cover in the sauce. Serve over immediately, with lemon wedges."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:40:23_screenshot.png"
    },
    {
      "name": "Chicken Scarpariello",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "6",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "1 pound Italian-style pork sausages",
        "1/4 cup olive oil",
        "1 chicken (about 3 pounds), cut into 10 pieces",
        "Salt and freshly ground pepper",
        "6 large potatoes, thinly sliced",
        "1/4 cup pickled onions",
        "1 cup pickled sweet peppers, cut into bite-sized pieces",
        "1/4 cup white wine vinegar or pickling liquid from the peppers"
      ],
      "sub_recipes": [],
      "instructions": [
        "Place the sausages in a medium skillet and prick them all over with a fork. Add cold water to come halfway up the sausages. Cover the pan, place over medium heat, and cook until the water has evaporated and the sausages are cooked through. Uncover and cook until browned all over. Cut the sausages into 1-inch pieces.",
        "In a Dutch oven large enough to hold all of the chicken in a single layer, heat the oil over medium heat."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:40:51_screenshot.png"
    },
    {
      "name": "Chicken Francese",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "4",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": "Pat the chicken pieces dry and place them in the brine. Sprinkle with salt and pepper. Cook, stirring occasionally, until golden, about 10 minutes. Add the garlic and cook for 2 to 3 minutes more, stirring occasionally. Turn the chicken to the other side. Turn the chicken occasionally, turning the heat to high and cook, stirring often, for 10 to 15 minutes, or until the liquid is reduced to a light glaze. Serve immediately.",
      "ingredients": [
        "4 pound boneless chicken cutlets",
        "Salt and freshly ground pepper",
        "2 large eggs",
        "1/2 cup all-purpose flour",
        "1/2 cup chicken broth",
        "1/4 cup dry white wine",
        "2 tablespoons fresh lemon juice (no taste)",
        "3 tablespoons olive oil",
        "3 tablespoons unsalted butter",
        "1 tablespoon chopped fresh flat-leaf parsley",
        "Lemon wedges"
      ],
      "sub_recipes": [],
      "instructions": [
        "Place the chicken cutlets between two sheets of plastic wrap. With a meat pounder or mallet, gently pound the slices to about a 1/4-inch thickness. Sprinkle the chicken generously with salt and pepper.",
        "Beat the eggs in a shallow bowl, season with salt and pepper, and beat until well blended. Spread the flour on a plate. Mix together the broth, wine, and lemon juice in a measuring cup or bowl.",
        "Heat the oil with the butter in a large skillet over medium heat until sizzling. Dip only enough of the cutlets in the flour as will fit in the pan in a single layer, dip them in the egg, and add to the pan. Cook, turning once, until golden brown on both sides, about 6 minutes total. Transfer to a serving plate and keep it warm. Repeat with the remaining chicken.",
        "When all of the chicken is done, add the broth mixture to the pan. Raise the heat and cook, scraping the bottom of the pan, until the sauce is slightly thickened. Stir in the parsley.",
        "Return the chicken pieces to the skillet and turn them over or twice in the sauce. Serve immediately, with lemon wedges."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:40:51_screenshot.png"
    },
    {
      "name": "Fiori di Zucca Fritti",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "any",
      "dish_role": "side",
      "serves": "4",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "1/2 cup all-purpose flour",
        "1/2 cup cornstarch",
        "Salt and freshly ground pepper",
        "1 cup ice water",
        "Vegetable oil for deep-frying",
        "16 zucchini or other squash blossoms"
      ],
      "sub_recipes": [],
      "instructions": [
        "In a small bowl, whisk together the flour, cornstarch, 1/2 teaspoon salt, and pepper to taste. Stir in the water. Let stand for 1 hour.",
        "Pour 2 inches of oil into a deep fryer or deep heavy saucepan. Heat over medium heat until the temperature reaches 375°F on a deep-frying thermometer or a drop of the batter sizzles and quickly rises to the surface of the oil.",
        "Dip a zucchini flower in the batter, coating it completely. Slip into the oil. Dip and add only as many flowers as fit comfortably without crowding the pan. Fry, turning once, for 1 to 2 minutes, until crisp. Remove the flowers from the pan with a slotted spoon, and drain on paper towels. Fry the remainder, and serve immediately."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:41:09_screenshot.png"
    },
    {
      "name": "Pollo Cacciatore al Forno",
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "4-50",
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "ingredients": [
        "One 3-pound chicken, cut into 8 pieces",
        "Salt and freshly ground pepper",
        "2 tablespoons olive oil",
        "2 green bell peppers, cored, seeded, and cut into narrow strips",
        "1 large onion, thinly sliced",
        "8 ounces mushrooms, trimmed and quartered",
        "2 garlic cloves, finely chopped",
        "2 cups canned Italian peeled tomatoes, drained and chopped",
        "1 teaspoon dried oregano"
      ],
      "sub_recipes": [],
      "instructions": [
        "Preheat the oven to 350°F. Oil one or more roasting pans, to hold the chicken pieces in a single layer. Rinse the chicken and pat dry. Arrange the pieces skin side down in the pan(s). Sprinkle with salt and pepper. Bake the chicken for 20 minutes.",
        "Turn the chicken pieces and sprinkle the skin side with salt and pepper. Bake for 20 minutes more, or until almost tender.",
        "While the chicken cooks, in one or more large skillets, heat the oil over medium heat. Add the peppers, onions, and mushrooms in a shallow layer. Cook, stirring frequently, until the vegetables are tender and lightly browned, about 15 minutes.",
        "Stir in the garlic and cook for 2 minutes. Add the tomatoes, oregano, and salt and pepper to taste. Cook 5 minutes more. Let cool slightly.",
        "Spoon off some of the fat from around the chicken. Pour the sauce and vegetables over and around the pieces. Bake 20 minutes longer. Serve hot."
      ],
      "tips": [],
      "source_image": "15:41:41_screenshot.png"
    },
    {
      "name": "Ah Beetz'",
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "1 pizza (8-10) or 6 pizzas (50)",
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "ingredients": [
        "1 envelope active dry yeast (6 envelopes for 6 pizzas)",
        "1 1/3 cups warm water (105° to 115°F) (8 cups for 6 pizzas)",
        "3 1/2 to 4 cups all-purpose flour (21 to 24 cups for 6 pizzas)",
        "2 teaspoons salt (1/4 cup for 6 pizzas)",
        "1 1/2 pounds fresh mozzarella, thinly sliced",
        "1/2 cup freshly grated Pecorino Romano or Parmigiano-Reggiano",
        "3 cups Olive oil"
      ],
      "sub_recipes": [
        {
          "name": "For the Sauce",
          "ingredients": [
            "2 pounds fresh plum tomatoes, peeled, seeded, and chopped, or one 12 pounds fresh 28-ounce can Italian crushed tomatoes (or 6 cans for 6 pizzas)",
            "1 garlic clove, finely chopped (6 garlic cloves for 6 pizzas)",
            "1/4 cup olive oil (1 1/2 cups for 6 pizzas)",
            "Salt"
          ]
        },
        {
          "name": "For the Topping",
          "ingredients": [
            "4 fresh basil leaves, torn into bits (24 for 6 pizzas)"
          ]
        }
      ],
      "instructions": [
        "For each pizza, sprinkle the yeast over the water in a small bowl. Let stand for 1 minute, or until the yeast is creamy. Stir until the yeast dissolves.",
        "In a large bowl, combine 3 1/2 cups of the flour and the salt. Add the yeast mixture, and stir until a soft dough forms. Turn the dough out onto a lightly floured surface and knead, adding more flour if necessary, until smooth and elastic, about 10 minutes.",
        "Lightly oil a large bowl. Place the dough in the bowl. Cover with plastic wrap. Let rise in a warm, draft-free place until doubled, about 1 1/2 hours.",
        "Oil a 15 x 10 x 1-inch jelly-roll pan. With your fist, flatten the dough. Place the dough in the center of the pan and stretch and flatten it out to fit. Cover with plastic wrap and let it rise for about 1 hour, until puffy and nearly doubled in bulk.",
        "To make the sauce, in a large saucepan, combine the tomatoes, garlic, oil, and salt to taste. Bring to a simmer and cook, stirring occasionally, until thickened, 15 to 20 minutes. Add the basil. Let the sauce cool.",
        "Preheat the oven to 450°F.",
        "With your fingertips, dimple the dough to make dimples at 1-inch intervals all over the surface. Spread the sauce over the dough, leaving a 1/2-inch border all around. Bake for 20 minutes.",
        "Remove the pizza from the oven and top with the mozzarella. Sprinkle with the grated cheese. Drizzle with oil. Return the pizza to the oven and bake for 5 minutes, or until the cheese is melted and the crust is browned. Cut into squares and serve hot."
      ],
      "tips": [],
      "source_image": "15:41:41_screenshot.png"
    },
    {
      "name": "Stincini",
      "meal_type": "any",
      "dish_role": "main",
      "serves": "1 pizza (10) or 5 pizzas (50)",
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "ingredients": [
        "1 envelope active dry yeast (5 envelopes for 5 pizzas)"
      ],
      "sub_recipes": [],
      "instructions": [],
      "tips": [],
      "source_image": "15:41:41_screenshot.png"
    },
    {
      "name": "Roasted Sausages, Peppers, Potatoes, and Onions",
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "4-50",
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "ingredients": [
        "1 pound potatoes, peeled and cut into 1-inch chunks",
        "1 green bell pepper, cored, seeded, and cut into 1-inch pieces",
        "1 red bell pepper, cored, seeded, and cut into 1-inch pieces",
        "1 medium onion, cut into 1-inch chunks",
        "12 pounds",
        "15",
        "15",
        "12"
      ],
      "sub_recipes": [],
      "instructions": [],
      "tips": [],
      "source_image": "15:41:48_screenshot.png"
    },
    {
      "name": "Eggplant Parmigiana",
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "6-50",
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "ingredients": [
        "2 medium eggplants (about 1 pound)",
        "Olive oil or vegetable oil for pan frying 2 1/2 cups Marinara Sauce (page 63)",
        "8 ounces fresh mozzarella, thinly sliced",
        "1/2 cup freshly grated Pecorino Romano or Parmigiano-Reggiano",
        "1 Salt",
        "6 quarts",
        "5 pounds",
        "2 cups"
      ],
      "sub_recipes": [],
      "instructions": [
        "Trim the eggplant and cut dry. Pour about 1/2 inch oil into one or more large, deep skillets and heat over medium heat. Fry the slices, in batches, in a single layer, turning once, until browned on both sides. Drain on paper towels.",
        "Preheat the oven to 350°F.",
        "Use 2 tablespoons of tomato sauce in one or more shallow baking dishes. Make a layer of eggplant slices, overlapping them slightly. Top with a layer of mozzarella, another layer of sauce, and a sprinkle of grated cheese. Repeat the layering, ending with eggplant, sauce, and grated cheese. Cover and bake can be refrigerated for up to 2 days. Bring to room temperature and sprinkle for several hours, or overnight. Remove it from the refrigerator about 30 minutes before baking.",
        "Bake for 45 to 50 minutes, or until the sauce is bubbling and the mozzarella is melted. Let stand for 10 minutes before serving."
      ],
      "tips": [],
      "source_image": "15:41:48_screenshot.png"
    },
    {
      "name": "Caesar Salad",
      "meal_type": "any",
      "dish_role": "main",
      "serves": "6",
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "ingredients": [
        "6 slices Italian or French bread, cut into (1/2 inch thick) bite-sized cubes",
        "1/4 cup extra virgin olive oil",
        "1 large egg",
        "1 large garlic clove, very finely minced",
        "4 anchovy fillets, drained and chopped",
        "1 tablespoon fresh lemon juice",
        "1 teaspoon Worcestershire sauce",
        "Salt and freshly ground pepper",
        "1/2 cup freshly grated Parmigiano-Reggiano",
        "1/3 cup extra virgin olive oil",
        "1 head romaine lettuce (about 1 1/2 pounds), washed, dried, and torn into bite-sized pieces"
      ],
      "sub_recipes": [],
      "instructions": [
        "To make the croutons, preheat the oven to 350°F.",
        "Spread the bread cubes in a single layer in one or more large shallow roasting pans. Drizzle with the olive oil and toss well. Bake, stirring occasionally, until the bread is toasted and golden brown, about 20 minutes. Set aside.",
        "To make the salad, place the egg(s) in a saucepan and cover with cold water. Bring the water to a boil over medium heat. Cook for 1 1/4 minutes. Drain the egg(s) and cool under running water. Peel.",
        "In a large bowl, combine the garlic and anchovies. Mash them together into a paste. Beat in the egg(s), lemon juice, Worcestershire, and salt and pepper to taste. Gradually beat in the cheese and olive oil to make a thick dressing.",
        "Toss the lettuce with the dressing. Sprinkle with the croutons. Toss again and taste for seasoning. Serve immediately."
      ],
      "tips": [
        "For the Croutons: 4 to 5 loaves, 2 cups",
        "For the Salad: 8, 8, 5 cans (2 ounces each), 3/4 cup, 3 tablespoons, 4 cups, 3 cups, 8"
      ],
      "source_image": "15:42:03_screenshot.png"
    },
    {
      "name": "Insalata di Mare",
      "meal_type": "any",
      "dish_role": "main",
      "serves": "6",
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "ingredients": [
        "2 pounds mussels",
        "Salt",
        "1 pound medium shrimp, shelled and deveined",
        "1 pound cleaned calamari (squid), cut crosswise into 1/2-inch rings",
        "1 cup thinly sliced celery",
        "1 cup pitted green olives",
        "1/3 cup extra virgin olive oil",
        "1/2 teaspoon grated lemon zest",
        "2 tablespoons fresh lemon juice, or to taste"
      ],
      "sub_recipes": [
        {
          "name": "Seafood Salad",
          "ingredients": [
            "10 pounds",
            "8 pounds",
            "8 pounds",
            "8 cups",
            "8 cups",
            "2 1/2 cups",
            "11/2 tablespoons",
            "1 cup, or to taste"
          ]
        }
      ],
      "instructions": [],
      "tips": [],
      "source_image": "15:42:03_screenshot.png"
    },
    {
      "name": "Almond Torte",
      "meal_type": "any",
      "dish_role": "main",
      "serves": "8",
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "ingredients": [
        "5 cups blanched almonds",
        "1 cup sugar",
        "2 cups sifted all-purpose flour",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1 cup (2 sticks) unsalted butter",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon almond extract",
        "1/2 cup seedless raspberry jam",
        "4 ounces semisweet or bittersweet chocolate",
        "1/4 cup heavy cream"
      ],
      "sub_recipes": [],
      "instructions": [
        "Preheat the oven to 350°F. Butter two 9-inch layer cake pans. Line the pans with circles of wax paper. Butter the paper and sprinkle the pans with flour. Tap out the excess.",
        "In a food processor or blender, combine the almonds and 1/4 cup of the sugar. Grind the nuts until very fine; do not overprocess or they will become oily.",
        "In the large bowl of an electric mixer, beat the egg yolks until thick and light. Beat in the remaining 3/4 cup sugar and the extracts. Stir in the almond mixture.",
        "In a clean bowl, with clean beaters, whip the egg whites until soft peaks form. Gently fold the egg whites into the almond mixture with a rubber spatula.",
        "Divide the batter evenly between the prepared pans. Bake for 20 to 25 minutes, or until the layers spring back when touched in the center. Cool on a wire rack for 10 minutes. Unmold the cakes and carefully peel off the paper. Turn the cakes right side up and let cool completely.",
        "When ready to serve, put one layer on the bottom of a cake plate. Place one cake layer upside down on the plate. Spread the jam evenly over the top. Place the second cake layer right side up on the first layer.",
        "Break up the chocolate into small pieces. In a small heavy-pot bowl set over, not in, a pot of simmering water, melt the chocolate with the heavy cream. Stir until smooth. Let the mixture cool slightly.",
        "Pour the glaze onto the top of the cake. Smooth the top with a metal spatula, allowing some of the chocolate to run down the sides of the cake. Then smooth the chocolate over the sides. Let set briefly, then remove the wax paper strips. Chill briefly to set the chocolate."
      ],
      "tips": [
        "2 tablespoons chopped fresh flat-leaf parsley 1 cup garlic cloves, minced 16",
        "Pinch of crushed red pepper To taste",
        "1 lemon, cut into wedges 6",
        "Place the mussels in cold water to cover for 30 minutes.",
        "Scrub the mussels with a stiff brush and scrape off any barnacles or seaweed. Discard any mussels with cracked shells or that do not shut tightly when tapped. Remove the beards by pulling them toward the narrow end of the shell.",
        "Steam the mussels in a large pot with 1/2 cup water. Cover and cook until the mussels open, 5 to 10 minutes. Discard any that refuse to open.",
        "Bring a large saucepan of water to a simmer. Add salt to taste and the shrimp. Cook for 2 to 3 minutes, until the shrimp are just cooked through. Scoop out the shrimp and cool them under cold running water; drain well. Leave the water boiling in the pot.",
        "Add the calamari to the boiling water and cook until just tender, about 1 minute. Drain thoroughly and cool under cold running water.",
        "Cut the shrimp into bite-sized pieces. Combine the shrimp, calamari, mussels, celery, and olives in a large bowl.",
        "Whisk together the oil, lemon zest, lemon juice, parsley, garlic, salt to taste, and the crushed red pepper.",
        "Pour the dressing over the salad mixture and toss well. (If you are making the salad ahead of time, toss with only half the dressing, cover and refrigerate for up to 2 hours. Toss with the remaining dressing just before serving.) Taste for seasoning. Garnish with the lemon wedges."
      ],
      "source_image": "15:42:03_screenshot.png"
    },
    {
      "name": "Chicken with Parsley Crumbs",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "4",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "1 chicken (about 3 pounds), cut up",
        "Salt and freshly ground pepper",
        "1/4 cup plain bread crumbs",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "1 large garlic clove, minced",
        "1 tablespoon butter",
        "1 tablespoon olive oil"
      ],
      "sub_recipes": [],
      "instructions": [
        "Preheat the oven to 375°F.",
        "Sprinkle the chicken all over with salt and pepper. Place the pieces skin side up in a baking pan. Bake for 30 minutes.",
        "Meanwhile, combine the bread crumbs, parsley, garlic, oil, and salt and pepper to taste in a small bowl.",
        "Sprinkle the chicken with the crumb mixture. Sprinkle with the remaining butter, patting it on so that it adheres. Bake for 20 to 30 minutes more or until the juices run clear when the chicken is cut near the bone. Serve hot or cold."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:42:54_screenshot.png"
    },
    {
      "name": "Melfi's Minestrone",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "lunch",
      "dish_role": "main",
      "serves": "2",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "1/4 cup corn or other small pasta",
        "Salt",
        "One zucchine can vegetable soup",
        "1/4 cup chopped ham (about 2 thin slices)",
        "2 tablespoons freshly grated Parmigiano-Reggiano"
      ],
      "sub_recipes": [],
      "instructions": [
        "Bring a small saucepan of water to a boil. Add the corn and salt to taste. Cook, stirring occasionally, until the corn is tender. Drain the pasta, reserving a little of the water.",
        "Pour the soup into a small saucepan and heat through.",
        "Stir the ham and cooked corn into the soup. Add a little of the cooking water if the soup is too thick. Turn off the heat and stir in the cheese. Serve immediately."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:42:54_screenshot.png"
    },
    {
      "name": "Tuna Salad with Green Beans and Tomatoes",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "any",
      "dish_role": "main",
      "serves": "2",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "One 7-ounce can tuna packed in olive oil",
        "1 large tomato, cut into bite-size pieces",
        "2 hard-cooked eggs, peeled and quartered",
        "3 or 4 thin slices red onion, quartered",
        "Pinch of dried oregano",
        "1 to 2 tablespoons fresh lemon juice",
        "Salt and freshly ground pepper",
        "8 ounces green beans, cooked and cut into bite-sized pieces",
        "Lemon wedges"
      ],
      "sub_recipes": [],
      "instructions": [
        "Place the tuna, with its oil, in a large bowl. Break it into pieces with a fork.",
        "Add the tomatoes, eggs, and onion. Sprinkle with the oregano, lemon juice, a pinch of salt, and pepper to taste. Toss gently.",
        "Arrange the green beans on a platter. Top with the tuna salad. Garnish with lemon wedges and serve immediately."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:42:54_screenshot.png"
    },
    {
      "name": "Zuppa di Cozze",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "4",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": "Mussels in Spicy Tomato Sauce",
      "ingredients": [
        "4 pounds mussels (or substitute small clams)",
        "4 garlic cloves, very finely chopped, plus 1 whole garlic clove",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "1 small peperoncino, crumbled, or a pinch of crushed red pepper",
        "1/4 cup olive oil",
        "1 cup dry white wine",
        "3 pounds ripe tomatoes, peeled, seeded, and chopped, or two 28- to 35-ounce cans Italian peeled tomatoes, drained and chopped",
        "Pinch of salt",
        "8 slices Italian bread, toasted"
      ],
      "sub_recipes": [],
      "instructions": [
        "Place the mussels in cold water to cover for 30 minutes. Drain and scrub them with a stiff brush. Remove the beards and any clinging sand. Discard any mussels that feel unusually heavy or light or any that remain open when tapped. Remove the beards by pulling them toward the narrow end of the shells.",
        "In a large saucepan, cook the chopped garlic, parsley, and peperoncino in the oil over low heat until the garlic is golden, about 1 minute. Stir in the wine and bring to a simmer. Add the tomatoes and salt. Cook over medium heat, stirring occasionally, until the sauce is slightly thickened, about 30 minutes.",
        "Gently stir in the mussels. Cover the pot. Cook until the mussels open, 5 to 10 minutes. Discard any that refuse to open.",
        "Rub the toast with the garlic clove. Serve with the mussels."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:42:54_screenshot.png"
    },
    {
      "name": "Orange and Fennel Salad",
      "meal_type": "any",
      "dish_role": "side",
      "serves": 4,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "ingredients": [
        "3 navel oranges, peeled and cut crosswise into sauce",
        "1 medium fennel bulb, trimmed and very thinly sliced",
        "1/3 red onion, very thinly sliced",
        "12 black olives",
        "3 tablespoons extra virgin olive oil",
        "Salt"
      ],
      "sub_recipes": [],
      "instructions": [
        "Arrange the orange slices and fennel slices alternately on a platter. Scatter the onion and black olives over the top. Drizzle with the olive oil, sprinkle with salt, and serve."
      ],
      "tips": [],
      "source_image": "15:43:18_screenshot.png"
    },
    {
      "name": "Arugula and Parmesan Salad",
      "meal_type": "any",
      "dish_role": "side",
      "serves": 2,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "ingredients": [
        "1 bunch arugula, washed and dried",
        "3 tablespoons extra virgin olive oil",
        "1 tablespoon lemon juice",
        "Salt and freshly ground pepper",
        "A small piece of Parmigiano-Reggiano cheese"
      ],
      "sub_recipes": [],
      "instructions": [
        "Cut off the arugula stems. Tear the leaves into bite-sized pieces.",
        "In a large bowl, whisk together the oil, vinegar, salt and salt and pepper to taste. Add the arugula and toss well. Pile the salad onto two plates.",
        "With a vegetable peeler, shave the cheese over the salad. Serve immediately."
      ],
      "tips": [],
      "source_image": "15:43:18_screenshot.png"
    },
    {
      "name": "Salmon Steaks with Avocado Salsa",
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": 4,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "ingredients": [
        "1 cup plain low-fat yogurt",
        "1 green onion, finely chopped"
      ],
      "sub_recipes": [],
      "instructions": [],
      "tips": [],
      "source_image": "15:43:18_screenshot.png"
    },
    {
      "name": "Scamalli in Hot Sauce",
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "4 to 6",
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "ingredients": [
        "2 pounds partially cooked fresh or frozen scamalli (reach or whole meat) 1/4 cup olive oil",
        "2 large garlic cloves, finely chopped",
        "Pinch of crushed red pepper, or to taste",
        "3 pounds ripe tomatoes, peeled, seeded, and chopped, or two 28-ounce cans",
        "1 cup chopped tomatoes, chopped, with their juice",
        "Fresh basil leaves",
        "Salt",
        "Fresh black pepper biscotti or toasted sliced Italian bread"
      ],
      "sub_recipes": [],
      "instructions": [
        "If the scamalli are frozen, place them in a bowl with cold water to cover and put the bowl in the refrigerator to thaw, several hours or overnight; change the water occasionally.",
        "Rinse the scamalli. Begin cutting it into 1/4-inch slices, when you come to a dark tube filled with spongy matter, pull or cut it out and discard, as it can be gritty. The tube can be outside of the body of the scamalli or within the flesh. Cut the scamalli into serving pieces.",
        "In a large saucepan, heat the oil with the garlic and crushed red pepper over medium-low heat until the garlic is golden. Add the tomatoes, wine, and salt to taste. Bring to a simmer, reduce the heat to low, and cook for 15 minutes, stirring occasionally.",
        "Add the scamalli and bring to a simmer. Cook, stirring occasionally, for 30 minutes or until the scamalli are tender when pierced with a fork and the sauce has become less thick. Stir in a little water if the sauce becomes too thick.",
        "Taste for seasoning.",
        "Meanwhile, if using friends, sprinkle them with cool water. Let stand for 10 minutes to soften slightly. Break them into chunks.",
        "Place a few pieces of friends or slices of toasted bread in each of four pasta bowls. Spoon on the scamalli and serve immediately."
      ],
      "tips": [],
      "source_image": "15:43:18_screenshot.png"
    },
    {
      "name": "Spaghetti Puttanesca",
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "4 to 6",
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "ingredients": [
        "3 garlic cloves, finely chopped",
        "1 small peperoncino, crumbled, or a pinch of crushed red pepper",
        "1/3 cup olive oil",
        "2 or 3 pounds ripe plum tomatoes, peeled, seeded, and chopped, or one 28- to 32-ounce can Italian peeled tomatoes, drained and chopped",
        "1 tablespoon tomato paste",
        "Salt",
        "1/3 cup pitted and chopped oil-cured olives",
        "2 tablespoons capers",
        "8 to 12 anchovy fillets, drained",
        "1/4 cup finely chopped fresh flat-leaf parsley",
        "1 pound spaghetti"
      ],
      "sub_recipes": [],
      "instructions": [],
      "tips": [],
      "source_image": "15:43:18_screenshot.png"
    },
    {
      "name": "Linguine Aglio Olio",
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "4",
      "prep_time": "",
      "cook_time": "",
      "calories": "",
      "protein": "",
      "carbs": "",
      "fat": "",
      "dietary_info": [],
      "ingredients": [
        "1/3 cup fruity olive oil",
        "2 to 3 tablespoons minced garlic",
        "1 small pepponcino, crumbled, or 1/2 teaspoon crushed red pepper",
        "1 pound linguine from the leaf parsley",
        "1 pound linguine",
        "Salt"
      ],
      "instructions": [
        "Pour the olive oil into a large skillet. Add the garlic and pepponcino and cook, stirring, over medium-low heat for 3 minutes, or until the garlic is lightly golden. Stir in the parsley and turn off the heat.",
        "Meanwhile, bring at least 4 quarts of water to a boil in a large pot. Add the pasta and salt to taste. Cook, stirring frequently, until the pasta is al dente; under no will from to the bite.",
        "Set aside 1 cup of the cooking water. Drain the pasta and add it to the skillet with the sauce. Cook over medium heat for 1 minute, tossing with tongs to coat the pasta with the sauce. Add 1/4 cup of the reserved cooking water if the pasta seems dry. Serve immediately."
      ],
      "tips": [],
      "source_image": "15:43:37_screenshot.png"
    },
    {
      "name": "Calamari Fritti",
      "meal_type": "any",
      "dish_role": "main",
      "serves": "6 to 8",
      "prep_time": "",
      "cook_time": "",
      "calories": "",
      "protein": "",
      "carbs": "",
      "fat": "",
      "dietary_info": [],
      "ingredients": [
        "2 pounds cleaned calamari (squid)",
        "1 cup all-purpose flour",
        "1 teaspoon salt",
        "Freshly ground pepper",
        "Olive oil or vegetable oil for deep-frying",
        "Lemon wedges"
      ],
      "instructions": [
        "Rinse the calamari thoroughly inside and out. Drain well. Cut the bodies crosswise into 1/2-inch rings. Cut the tentacles in half through the base. Pat dry.",
        "Spread the flour on a sheet of wax paper and season with the salt and pepper to taste.",
        "Pour 2 inches of oil into a deep heavy saucepan or a deep fryer. Heat the oil to 375°F on a deep-frying thermometer, or until a small piece of the calamari sizzles and rises to the surface when added to the oil. Working in small batches to avoid crowding, dredge the calamari in the seasoned flour. Shake off the excess flour. Slip the pieces into the hot oil, without crowding the pan, and cook until the calamari are a light golden brown, about 3 minutes. With a slotted spoon, transfer the calamari to paper towels to drain. Repeat with the remaining calamari.",
        "Serve hot with lemon wedges."
      ],
      "tips": [],
      "source_image": "15:43:37_screenshot.png"
    },
    {
      "name": "Lobster Fra Diavolo",
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "4 to 6",
      "prep_time": "",
      "cook_time": "",
      "calories": "",
      "protein": "",
      "carbs": "",
      "fat": "",
      "dietary_info": [],
      "ingredients": [],
      "instructions": [],
      "tips": [],
      "source_image": "15:43:37_screenshot.png"
    },
    {
      "name": "Pears al Vino Bianco",
      "meal_type": "any",
      "dish_role": "main",
      "serves": "6",
      "prep_time": "",
      "cook_time": "",
      "calories": "",
      "protein": "",
      "carbs": "",
      "fat": "",
      "dietary_info": [],
      "ingredients": [
        "6 Bosc or Anjou pears (not too ripe)",
        "1 1/2 cups dry white wine",
        "1/2 cup water",
        "1/4 cup sugar"
      ],
      "instructions": [],
      "tips": [],
      "source_image": "15:43:37_screenshot.png"
    },
    {
      "name": "Vanilla Bean",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "any",
      "dish_role": "sub_recipe",
      "serves": null,
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "2 strips lemon zest, about 2 inches long",
        "1 vanilla bean"
      ],
      "sub_recipes": [],
      "instructions": [
        "With a dominante spoon or melon baller, working from the bottom of the pears, scoop out the core and seeds.",
        "In a medium large saucepan, half fill with water, add sugar; bring the wine, water, sugar, lemon zest, and vanilla bean to a simmer over medium heat, stirring until the sugar is dissolved. Add the pears and reduce the heat to low. Cover the pan and cook, turning the pears once, for 20 minutes, or until they are tender throughout when pierced with a small knife.",
        "Transfer the pears to a serving dish. Turn the heat under the pan to medium-high and cook the syrup, uncovered, about 8-10 minutes, or until reduced by half.",
        "Pour the syrup over the pears. Let cool slightly, then cover and chill before serving."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:44:02_screenshot.png"
    },
    {
      "name": "How to Cut a Garlic",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "any",
      "dish_role": "sub_recipe",
      "serves": null,
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": "There are three ways to use garlic in cooking:",
      "ingredients": [],
      "sub_recipes": [],
      "instructions": [
        "For a mild garlic taste, use it whole. Smack it with the flat side of a knife to open it up, and put it in the oil. Soon for the cloves out before serving the dish.",
        "For a medium garlic taste, i.e., to sautéing, slice it razor-thin. You don't need to use a razor, but you get the point.",
        "For maximum garlic flavor, finely chop it so that it disperses throughout the food. Try food points. Avoid garlic powder. Avoid dried garlic powder—that's no megaphone behavior."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:44:33_screenshot.png"
    },
    {
      "name": "Zuppa di Scarola e Fagioli",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "4",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": "Scarola and Bean Soup",
      "ingredients": [
        "1 medium escarole (about 1 pound)",
        "2 garlic cloves, finely chopped",
        "1/4 cup olive oil",
        "2 medium ripe tomatoes, chopped, or 1 cup chopped canned Italian peeled tomatoes",
        "2 cups water",
        "2 cups dried or 1 cup beef broth, preferably homemade (or use water)",
        "3 cups cooked or canned cannellini or Great Northern beans",
        "1 cup elbow macaroni or small shells",
        "Salt and freshly ground pepper",
        "1/4 cup freshly grated Pecorino Romano or Parmigiano-Reggiano"
      ],
      "sub_recipes": [],
      "instructions": [
        "Trim off the base of the escarole and discard any bruised leaves. Wash the leaves in several changes of cold water, paying special attention to the central ribs where soil tends to collect. Shred the leaves and cut crosswise into 2-inch strips.",
        "In a large pot, cook the garlic in the olive oil over medium-low heat until golden. Add the escarole and cook, stirring frequently, until the escarole is tender.",
        "Add the broth and beans and cook for 20 minutes. Stir in the elbows and season to taste with salt and pepper. Cook 10 minutes more, or until the pasta is tender.",
        "Just before serving, sprinkle with the cheese."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:44:33_screenshot.png"
    },
    {
      "name": "Uova in Purgatorio",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "breakfast",
      "dish_role": "main",
      "serves": "4",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "1/4 cup olive oil, lightly crushed",
        "2 tablespoons olive oil",
        "2 cups canned tomato puree",
        "4 fresh basil leaves, torn into pieces, or a pinch of dried oregano"
      ],
      "sub_recipes": [],
      "instructions": [],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:44:50_screenshot.png"
    },
    {
      "name": "Pork Chops with Vinegar Peppers",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "4",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "4 tablespoons olive oil",
        "4 pork chops, about 1 inch thick",
        "Salt and freshly ground pepper",
        "2 garlic cloves, lightly crushed",
        "2 cups sliced mild pickled peppers, with 2 tablespoons of their juice (add a few hot pepperoncini if you like)"
      ],
      "sub_recipes": [],
      "instructions": [
        "Heat the oil in a large skillet over medium-high heat. When the oil is very hot, pat the chops dry with paper towels. Sprinkle with salt and pepper. Cook the chops, turning once, for about 3 minutes on each side, or until browned.",
        "Lower the heat to medium and scatter the garlic around the chops. Cover the pan. Cook for 5 to 8 minutes, or until the chops are just slightly pink when cut near the bone. Do not overcook, or the chops will be dry. Transfer the chops to a plate and keep warm.",
        "Add the peppers and the 2 tablespoons liquid to the skillet. Cook, stirring, for 1 to 2 minutes, or until the peppers are just heated through. Spoon the peppers over the chops and serve immediately."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:44:50_screenshot.png"
    },
    {
      "name": "Potatoes and Eggs Sandwiches",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "lunch",
      "dish_role": "main",
      "serves": "4",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "2 large russet potatoes, peeled",
        "1/4 cup olive oil",
        "Salt",
        "8 large eggs, beaten",
        "Freshly ground pepper",
        "8 Italian rolls"
      ],
      "sub_recipes": [],
      "instructions": [
        "Cut the potatoes in half. Slice each half into 1/4-inch-thick slices.",
        "Pour the oil into a large skillet. Heat over medium heat until the oil bubbles when a piece of potato is added. Pat the potato slices dry and place them in the skillet. Cook, turning the pieces frequently, until they are golden brown and cooked through, about 20 minutes.",
        "Beat the eggs with salt and pepper to taste. Pour the eggs over the potatoes. When the eggs have begun to set, turn the potato and egg mixture. Cook, turning the potatoes and eggs occasionally, until the eggs are done to taste.",
        "Cut 4 lengthwise slits in the bread and pull out the soft crumb from the center. Fill the bread with the potatoes and eggs. Cut the loaf into 4 sandwiches. Serve hot or warm."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:44:50_screenshot.png"
    },
    {
      "name": "Peppers and Eggs Sandwiches",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "lunch",
      "dish_role": "main",
      "serves": "4",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "3 tablespoons olive oil",
        "1 large red bell pepper, cored, seeded, and cut into 1-inch pieces",
        "1 large green bell pepper, cored, seeded, and cut into 1-inch pieces",
        "1 medium onion, sliced",
        "8 large eggs",
        "Freshly ground pepper",
        "1 long loaf Italian or French bread"
      ],
      "sub_recipes": [],
      "instructions": [],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:44:50_screenshot.png"
    },
    {
      "name": "Fried Veal Cutlets",
      "meal_type": "any",
      "dish_role": "main",
      "serves": "4",
      "calories": "",
      "protein": "",
      "carbs": "",
      "fat": "",
      "dietary_info": [],
      "ingredients": [
        "2 large eggs",
        "1/2 cup freshly grated Parmigiano-Reggiano",
        "Salt and freshly ground pepper",
        "1 cup plain bread crumbs",
        "1 pound veal, chicken, or turkey cutlets",
        "Vegetable oil",
        "Lemon wedges"
      ],
      "sub_recipes": [],
      "instructions": "In a shallow plate, beat the eggs with the cheese and salt and pepper to taste. Spread the bread crumbs on a sheet of wax paper. Dip each piece of the veal in the egg mixture, then in the bread crumbs to coat it completely. Let dry for 15 minutes. Pour 1/4 inch of oil into a deep heavy skillet. Heat over medium heat until a small drop of the egg mixture sizzles and cooks quickly when dropped into the skillet. Add only as many cutlets to the pan as will fit comfortably in a single layer. Cook, turning once, until golden brown on both sides, about 5 minutes. Transfer the cutlets to a plate lined with paper towels to drain. Continue cooking the remaining cutlets in the same way. If there is any egg mixture left over after all the cutlets have been coated, stir in some bread crumbs until the mixture holds a soft shape. Fry the egg cutlet, turning once, until golden brown and cooked through. Serve the cutlets hot with lemon wedges.",
      "tips": [],
      "source_image": "15:45:02_screenshot.png"
    },
    {
      "name": "Neapolitan-Style Stuffed Peppers",
      "meal_type": "any",
      "dish_role": "main",
      "serves": "6",
      "calories": "",
      "protein": "",
      "carbs": "",
      "fat": "",
      "dietary_info": [],
      "ingredients": [
        "2 medium eggplants",
        "6 large red, yellow, or green bell peppers",
        "1/2 cup plus 3 tablespoons olive oil",
        "3 medium tomatoes, peeled, seeded, and chopped",
        "3/4 cup pitted and chopped black olives, such as Gaeta or oil-cured olives",
        "6 anchovy fillets, finely chopped",
        "3 tablespoons rinsed and drained capers",
        "1 large garlic clove, finely chopped",
        "3 tablespoons chopped fresh flat-leaf parsley",
        "Freshly ground pepper",
        "1/2 cup plus 1 tablespoon plain bread crumbs"
      ],
      "sub_recipes": [],
      "instructions": "Trim the eggplants and cut them into 3/4-inch cubes. Layer them in a colander, sprinkling each layer with salt. Place the colander over a plate and let drain for 1 hour. Preheat the oven to 450°F. Oil a baking pan just large enough to hold the peppers upright. With a small knife, cut out the stems of the peppers and remove the seeds and white membranes. Rinse the eggplant and pat dry with paper towels. In a large skillet, heat the 1/2 cup oil over medium heat. Add the eggplant and cook, stirring occasionally, until tender, about 10 minutes. Stir in the tomatoes, olives, anchovies, capers, garlic, parsley, and pepper to taste. Bring to a simmer and cook for 5 minutes. Stir in the 1/2 cup bread crumbs and remove from the heat. Stuff the eggplant mixture into the peppers. Stand the peppers in the prepared pan. Sprinkle with the remaining 1 tablespoon bread crumbs and drizzle with the remaining 3 tablespoons oil. Pour 1 cup water around the peppers. Bake for 1 hour, or until the peppers are tender and lightly browned. Serve hot or at room temperature.",
      "tips": [],
      "source_image": "15:45:02_screenshot.png"
    },
    {
      "name": "Risotto with Truffles and Champagne",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "2",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "4 cups beef broth",
        "3 cups water",
        "4 tablespoons unsalted butter",
        "1 tablespoon olive oil",
        "1/2 cup minced shallots or onion",
        "1 cup Arborio rice, such as Alboiio or Carnaroli",
        "1/2 cup Champagne or dry white wine",
        "Salt and freshly ground pepper",
        "1 fresh white or black truffle, or use a jarred truffle"
      ],
      "sub_recipes": [],
      "instructions": [
        "In a saucepan, combine the broth and water, bring to a simmer, and keep warm over very low heat.",
        "In a deep wide saucepan or skillet, melt 2 tablespoons of the butter with the oil over medium heat. Add the shallots and cook for 2 minutes, or until softened but not browned.",
        "Add the rice and stir for 1 minute. Add the Champagne and cook, stirring, until most of the liquid is absorbed. Add 1/2 cup of the warm broth and cook, stirring constantly until absorbed. Continue cooking, adding the broth 1/2 cup at a time and stirring until it is absorbed, for 18 to 20 minutes, or until the rice is al dente, tender yet firm to the bite. If you are using a jarred truffle, add the liquid from the jar to the simmering broth. Season with salt and pepper to taste. The rice should be moist and creamy. Add more liquid if necessary. If you run out of liquid, use water.",
        "Remove from heat and stir in the remaining 2 tablespoons butter. Add the fresh truffle, grate the truffle over the risotto. If using a jarred truffle, chop it fine and stir it into the risotto. Stir in the remaining 1 tablespoon butter. Serve immediately."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:45:32_screenshot.png"
    },
    {
      "name": "Filet Mignon with Red Wine Sauce",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "2",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "2 tablespoons unsalted butter",
        "1 teaspoon olive oil",
        "2 filet mignon steaks, about 1 inch thick",
        "Salt and freshly ground pepper",
        "Sauce:",
        "2 tablespoons minced shallots or green onions",
        "1 cup dry red wine, such as Barbera",
        "1 tablespoon unsalted butter"
      ],
      "sub_recipes": [],
      "instructions": [
        "In a medium skillet, melt the butter with the oil over high heat. Pat the steaks dry and place them in the skillet. Cook for 1 1/2 to 2 minutes on each side for rare. Sprinkle with salt and pepper and transfer the steaks to hot serving plates.",
        "Pour off all but 1 tablespoon of the fat from the skillet and cook for 1 minute. Add the wine and bring to a simmer. Cook, scraping the bottom of the pan, until the wine is reduced and slightly syrupy. Remove from the heat and swirl in the remaining 1 tablespoon butter.",
        "Spoon the sauce over the steaks and serve immediately."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:45:32_screenshot.png"
    },
    {
      "name": "Shrimp Scampi",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "2",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "4 tablespoons unsalted butter",
        "2 tablespoons olive oil",
        "1 clove garlic, minced",
        "16 large shrimp, shelled and deveined",
        "Pinch of salt",
        "2 tablespoons very finely chopped fresh flat-leaf parsley, plus a few sprigs for garnish",
        "2 tablespoons fresh lemon juice",
        "Lemon wedges"
      ],
      "sub_recipes": [],
      "instructions": [
        "In a large skillet, melt the butter with the olive oil over medium-high heat. When the butter foams and subsides, stir in the garlic. Cook, stirring occasionally, until the garlic is lightly golden, about 1 minute. Do not let the garlic burn.",
        "Increase the heat to medium-high and add the shrimp and salt. Cook for 2 to 3 minutes, turning the shrimp once, until they are just pink. Stir in the parsley and lemon juice and cook 1 minute more. Serve garnished with lemon wedges and parsley sprigs."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:45:32_screenshot.png"
    },
    {
      "name": "Veal Scaloppine Marsala",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "2",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "8 ounces veal top thin-sliced chicken cutlets",
        "Salt and freshly ground pepper",
        "1/4 cup all-purpose flour",
        "2 tablespoons unsalted butter",
        "2 tablespoons vegetable oil",
        "1/4 cup mushrooms, washed and thinly sliced",
        "1/2 cup dry Marsala"
      ],
      "sub_recipes": [],
      "instructions": [
        "Place the cutlets between two sheets of plastic wrap. Using a meat pounder or mallet, pound them gently to about a 1/4-inch thickness. Sprinkle them with salt and pepper. Spread the flour on a piece of waxed paper.",
        "In a large skillet, melt 1 tablespoon of the butter with 1 tablespoon of the oil over medium heat. Add the mushrooms and salt and pepper to taste. Cook, stirring often, until the mushrooms are tender and lightly browned, about 3 minutes. Transfer to a plate and set aside.",
        "Add the remaining 1 tablespoon each butter and oil to the skillet. When the butter is melted, dip each veal or chicken slice in the flour as well as in the pan in a single layer, then lay the slices in the pan. Cook the veal until nicely browned on both sides, about 1 minute per side. Transfer the slices to the plate with the mushrooms. Repeat with the remaining veal.",
        "Add the Marsala to the skillet and cook over high heat, stirring, until the wine is reduced and thickened.",
        "Return the veal and mushrooms to the pan. Cook very briefly, turning the veal in the sauce to warm through. Serve hot."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:45:58_screenshot.png"
    },
    {
      "name": "Verdure alla Griglia",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "any",
      "dish_role": "side",
      "serves": "8",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [
        "VEGETARIAN"
      ],
      "description": null,
      "ingredients": [
        "1 medium eggplant, trimmed and cut into 1/2-inch-thick slices",
        "Salt",
        "1 large red or Spanish onion, cut into 1/2-inch-thick slices",
        "2 large mushrooms, such as portobello, stems removed",
        "4 medium tomatoes, cored and cut crosswise in half",
        "2 large red or yellow bell peppers, cored, seeded, and cut into quarters",
        "Olive oil",
        "Freshly ground pepper",
        "2 garlic basil leaves, torn into bits"
      ],
      "sub_recipes": [],
      "instructions": [
        "Sprinkle the eggplant slices generously with salt. Place the slices in a colander and let drain over a plate for at least 30 minutes. Rinse the slices and pat dry.",
        "Prepare a medium-hot charcoal fire or preheat a gas grill or the broiler. Place the grill rack or broiler pan 4 inches from the heat.",
        "Generously brush all the vegetables with olive oil and sprinkle with salt and pepper. Place the"
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:46:24_screenshot.png"
    },
    {
      "name": "Salsiccie alla Griglia",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "6",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": "Grilled Sausages",
      "ingredients": [
        "6 plump, assorted Italian pork sausages, such as sweet, hot, parsley-and-cheese, fennel, and wine"
      ],
      "sub_recipes": [],
      "instructions": [
        "Prepare a medium-hot charcoal fire or preheat a gas grill or the broiler. Place the grill rack or broiler pan 4 inches from the heat.",
        "Score the sausages on the grill and cook, turning them once or twice, until browned and cooked through. Use tongs to turn the sausages and be careful not to pierce their skins, or the juices will run out and cause dangerous flare-ups."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:46:24_screenshot.png"
    },
    {
      "name": "Tonno alla Griglia",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "4",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": "Tuna Steaks with Lemon and Oregano",
      "ingredients": [
        "4 tuna steaks, about 1 inch thick, trimmed",
        "Olive oil",
        "Salt and freshly ground pepper",
        "1 tablespoon lemon juice",
        "1/2 teaspoon dried oregano"
      ],
      "sub_recipes": [],
      "instructions": [
        "Prepare a medium-hot charcoal fire or preheat a gas grill or the broiler. Place the grill rack or broiler pan 4 inches from the heat.",
        "Brush the tuna steaks on both sides with oil and season with salt and pepper to taste.",
        "Grill the tuna, turning once, until browned but still pink inside, about 4 minutes.",
        "In a small bowl, whisk together a tablespoon olive oil, the lemon juice, oregano, and salt and pepper to taste. Pour the lemon juice mixture over the tuna steaks and serve immediately."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:46:24_screenshot.png"
    },
    {
      "name": "Rollatine di Pesce Spada",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "6",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "1 1/2 pounds swordfish, skin removed and cut into very thin slices",
        "3/4 cup plain bread crumbs",
        "2 tablespoons chopped drained capers",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "1 large garlic clove, minced",
        "Salt and freshly ground pepper",
        "1/4 cup olive oil",
        "2 tablespoons fresh lemon juice"
      ],
      "sub_recipes": [],
      "instructions": [
        "Prepare a medium-hot fire in a charcoal grill or preheat a gas grill or the broiler. Place the grill rack or broiler pan 4 inches from the heat.",
        "Place the swordfish slices between two sheets of plastic wrap. Using a meat pounder or a mallet, gently pound the slices to an even 1/4-inch thickness. Cut the fish into 3 x 2-inch pieces.",
        "In a bowl, combine the bread crumbs, capers, parsley, garlic, salt and pepper to taste. Add 3 tablespoons of the olive oil and mix to combine.",
        "Place a tablespoon of the crumb mixture at one narrow end of each piece of fish, roll up the fish, and fasten it closed with a toothpick.",
        "In a large bowl, whisk together the remaining 1 tablespoon oil and the lemon juice. Brush the swordfish rolls with any remaining bread crumb mixture, patting it so that it adheres.",
        "Grill the rolls for 3 to 4 minutes on each side, or until they are browned and feel firm when pressed in the center. They should still be slightly rare. Serve hot with lemon wedges."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:46:32_screenshot.png"
    },
    {
      "name": "Spiedini",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "6",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "1 1/2 pounds veal cutlets",
        "Salt and freshly ground pepper",
        "8 ounces fresh mozzarella",
        "1 bay leaf for each piece of the leaf parsley",
        "2 garlic cloves, minced",
        "3 tablespoons olive oil",
        "3/4 cup plain bread crumbs"
      ],
      "sub_recipes": [],
      "instructions": [
        "Prepare a medium-hot charcoal fire or preheat a gas grill or the broiler. Place the grill rack or broiler pan 4 inches from the heat.",
        "Place the cutlets between two sheets of plastic wrap. Using a meat pounder or mallet, pound them gently to a 1/4-inch thickness.",
        "Cut the spiedini: a 3 x 3-inch pieces. Sprinkle with salt and pepper. Cut the mozzarella into 6 x 1/2-inch thick slices. Place a piece of cheese across the center of each veal cutlet. Sprinkle with the parsley and garlic. Roll up each piece of veal from one of the short sides.",
        "Hold two metal or bamboo skewers parallel about 1 inch apart, spear one of the rolls on the left skewer, then the same roll on the right skewer. Repeat with the remaining rolls.",
        "Skewers: Leave an inch or two clear at the base for easy handling. Thread 6 few more rolls on the skewers in the same way: the rolls should be barely touching. Skewer the remaining rolls in the same way.",
        "Brush the rolls with the olive oil and sprinkle with the crumbs, patting them so they adhere. Grill until the skewers turning once, just until the meat is browned and the cheese is slightly melted, about 10 minutes.",
        "Slide the rolls off the skewers onto a heated serving platter. Serve immediately."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:46:32_screenshot.png"
    },
    {
      "name": "Balsamic Grilled Veal Chops",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "4",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "4 veal loin or rib chops, about 1 inch thick",
        "2 tablespoons olive oil",
        "1 tablespoons balsamic vinegar",
        "2 tablespoons chopped fresh rosemary",
        "Salt and freshly ground pepper"
      ],
      "sub_recipes": [],
      "instructions": [
        "Prepare the chops in a shallow dish and sprinkle them with the oil, vinegar, rosemary, salt and salt and pepper on both sides. Turn them to coat evenly. Let the chops stand at room temperature while you prepare a medium-hot charcoal fire or preheat a gas grill or broiler.",
        "Set a grill rack or broiler pan about 4 inches from the heat. Grill or broil the chops for 3 to 4 minutes per side for medium-rare. Serve immediately."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:46:32_screenshot.png"
    },
    {
      "name": "Grilled Spareribs",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "dinner",
      "dish_role": "main",
      "serves": "4",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "1/4 cup olive oil",
        "2 cloves garlic, minced",
        "1 tablespoon chopped fresh sage",
        "1 tablespoon chopped fresh rosemary",
        "Pinch of crushed red pepper",
        "Salt",
        "4 pounds spareribs, cut into individual ribs"
      ],
      "sub_recipes": [],
      "instructions": [
        "In a shallow dish, combine the oil, garlic, sage, rosemary, red pepper, and salt to taste. Add the ribs and stir them to coat with the marinade. Cover and refrigerate for at least several hours, or overnight.",
        "Prepare a medium-hot charcoal fire or preheat a gas grill or the broiler. Set the rack or broiler pan about 6 inches from the heat.",
        "Grill or broil the ribs, turning them frequently, until browned and cooked through, about 20 minutes. Serve hot."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:46:44_screenshot.png"
    },
    {
      "name": "Ricotta Cheesecake",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "any",
      "dish_role": "main",
      "serves": "12",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": "Dip the remaining sixteenth in the espresso and arrange them in a single layer in the bottom of an 8-inch square pan. Spread half the mascarpone mixture over the sixteenth. Sprinkle with half the chocolate. Top with the remaining sixteenth in the espresso. Top with the remaining mascarpone mixture, spreading it smooth. Sprinkle with the remaining chocolate. Cover with plastic wrap. Refrigerate for several hours, or overnight, before serving.",
      "ingredients": [
        "8 ounces ricotta cheese",
        "8 large eggs",
        "2 teaspoons vanilla extract",
        "1 teaspoon grated orange zest",
        "1 teaspoon grated lemon zest",
        "6 tablespoons flour",
        "1/4 cup cornstarch"
      ],
      "sub_recipes": [],
      "instructions": [
        "Preheat the oven to 350°F.",
        "Butter a 9-inch springform pan. Dust the pan with flour and tap out the excess. Place the pan on a water bath or roasting pan in the center of a large baking sheet. Mold the foil tightly around the pan so that water cannot seep in.",
        "In a food processor or blender, puree the ricotta until very smooth. Pour the ricotta into a large bowl. Add the eggs, vanilla, and zests and whisk until well blended.",
        "Sift together the sugar and cornstarch. Add to the ricotta mixture and stir until smooth.",
        "Pour the batter into the prepared pan and place on the center rack with a large roasting pan and place it on the middle rack of the oven. Carefully pour hot water to come to a depth of 1 inch into the roasting pan.",
        "Bake for 1 1/2 hours or until the top of the cheesecake is golden and a knife inserted 2 inches from the center comes out almost clean.",
        "Turn off the oven and prop the door open with a wooden spoon. Let the cake cool for 30 minutes in the turned-off oven.",
        "Remove the cake from the roasting pan and remove the foil wrapping. Cool to room temperature on a wire rack.",
        "Serve at room temperature or slightly chilled. Wrap leftovers tightly and store in the refrigerator."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:47:19_screenshot.png"
    },
    {
      "name": "Torta Caprese",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "any",
      "dish_role": "main",
      "serves": "10",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "8 ounces almonds (about 1 1/2 cups)",
        "1/2 pound (2 sticks) unsalted butter, softened",
        "1 cup sugar",
        "6 large eggs, separated, at room temperature",
        "8 ounces semisweet chocolate, grated and cooled",
        "Pinch of salt",
        "Confectioners' sugar",
        "Whipped cream (optional)"
      ],
      "sub_recipes": [],
      "instructions": [
        "Preheat the oven to 350°F. Butter a 9-inch springform pan. Line the base with wax paper or parchment. Butter the paper and sprinkle it with flour. Tap out the excess.",
        "In a food processor grind the almonds very fine.",
        "In the large bowl of an electric mixer, beat the butter and 3/4 cup of the sugar on high speed until very light and fluffy, about 3 minutes. Add the egg yolks one at a time, beating well after each addition. Stir in the chocolate and almonds.",
        "In the large bowl of an electric mixer fitted with the whisk, on low speed until creamy. Increase the speed to high and beat in the remaining 1/4 cup sugar. Continue to beat until the egg whites hold soft peaks when the beaters are lifted.",
        "Fold about one quarter of the whites into the chocolate mixture to lighten it. Gently fold in the remaining whites."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:47:19_screenshot.png"
    },
    {
      "name": "Biscotti di Pinoli",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "any",
      "dish_role": "main",
      "serves": "30",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "One 8-ounce can almond paste",
        "1 cup granulated sugar, plus more for sprinkling",
        "1 cup confectioners' sugar, plus more for decorating",
        "2 cups Pignoli nuts or shaved almonds"
      ],
      "sub_recipes": [],
      "instructions": [
        "Preheat the oven to 350° F. Generously butter a large baking sheet.",
        "Crumble the almond paste into the large bowl of an electric mixer. Beat in the 2 egg whites and the confectioners' sugar until smooth. The batter should be very soft and sticky. If it is not, beat the extra egg white and add another tablespoon of egg white.",
        "Place the pignoli nuts in a small bowl. Drop a scant tablespoonful of the batter into the nuts and roll it into a ball. Coating the cookies completely with nuts helps prevent them from sticking to the baking sheet, but don't worry if some of the batter shows through. Place the cookies on the baking sheet about 1 inch apart.",
        "Bake for 18 to 20 minutes, or until lightly browned. Let cool for 2 minutes on the pan, then transfer the cookies to racks to cool completely. Dust the cooled cookies with confectioners' sugar. Store in an airtight container, or in the freezer up to one month."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:47:19_screenshot.png"
    },
    {
      "name": "Baba au Rhum",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "any",
      "dish_role": "main",
      "serves": "8 to 10",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": null,
      "ingredients": [
        "1 package active dry yeast",
        "1/4 cup warm water (100° to 110°F)",
        "6 large eggs, at room temperature",
        "1 tablespoon grated lemon zest",
        "2 1/2 cups all-purpose flour",
        "1/2 teaspoon sugar",
        "1/2 teaspoon salt",
        "12 tablespoons (1 1/2 sticks) unsalted butter, softened"
      ],
      "sub_recipes": [
        {
          "name": "For the Syrup",
          "ingredients": [
            "1 1/2 cups sugar",
            "2 cups water",
            "1/2 cup dark rum",
            "Whipped cream"
          ]
        }
      ],
      "instructions": [
        "Generously butter a 10-inch Bundt or tube pan.",
        "Sprinkle the yeast over the warm water in a measuring cup or a small bowl. Let stand for 1 minute, or until creamy, then stir until dissolved.",
        "In a large mixing bowl, beat the eggs and lemon zest until blended. Beat in the flour, sugar, and salt. Add the yeast and butter and beat until well blended.",
        "Scrape the dough into the prepared pan. The dough should be quite watery and let stand in a warm place for about 1 hour, or until the dough has doubled in volume.",
        "Preheat the oven to 350°F.",
        "Bake the cake for 50 minutes, or until it is golden and a cake tester inserted in the center comes out clean. Invert the cake onto a wire rack to cool for 10 minutes. Set the pan aside.",
        "Meanwhile, make the syrup. In a medium saucepan, bring the sugar and water to a boil. Boil, stirring to"
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:47:19_screenshot.png"
    },
    {
      "name": "Mille Foglie",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "any",
      "dish_role": "main",
      "serves": "8",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": "Napoletana",
      "ingredients": [
        "For the Pastry Cream:",
        "2 cups milk",
        "1/4 cup sugar",
        "1/4 cup all-purpose flour",
        "3 large egg yolks",
        "1 tablespoon vanilla extract",
        "1 pound frozen all-butter puff pastry, thawed",
        "Confectioners' sugar"
      ],
      "sub_recipes": [],
      "instructions": [
        "To make the pastry cream, bring 1 cup of the milk and the sugar to a simmer in a heavy saucepan over medium heat, stirring to dissolve the sugar. Remove from the heat.",
        "In a large heatproof bowl, whisk the egg yolks and the remaining 1 cup milk until blended. Place the flour in a sieve and sift it over the egg yolks, whisking until smooth. Beat in the hot milk with a little at a time.",
        "When all of the milk has been added, transfer the mixture to the saucepan and return it to the heat. Cook, stirring constantly, over medium heat until the mixture begins to boil. Reduce the heat and cook for 30 seconds more. Remove the pan from the heat and stir in the vanilla.",
        "Transfer the pastry cream to a bowl. Cover with plastic wrap, pressing the plastic directly against the surface. Refrigerate until chilled, at least 2 hours.",
        "On a lightly floured surface, roll out the puff pastry to a 14 × 10-inch rectangle. Place the pastry on a large ungreased baking sheet. Refrigerate for 30 minutes.",
        "Preheat the oven to 400°F.",
        "With a fork, prick the dough all over. Invert an ungreased baking sheet on top of the dough. Bake for 15 minutes. Remove the top baking sheet, prick the dough again, and bake 5 to 8 minutes more, or until the pastry is golden brown. Slide the pastry onto a rack and let cool completely.",
        "Place the pastry on a cutting board. With a serrated knife, using a sawing motion, cut the pastry crosswise into 3 equal strips. Place one strip on a serving platter. Spread with half of the pastry cream. Top with a second layer and the remaining pastry cream. Place the remaining layer on top. Dust with confectioners' sugar.",
        "Sprinkle the mille foglie generously with confectioners' sugar. With a serrated knife, cut into 1 1/2-inch slices and serve."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:47:52_screenshot.png"
    },
    {
      "name": "Cannoli",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "any",
      "dish_role": "main",
      "serves": "16",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": "Cannoli tubes are available at kitchenware shops, generally in sets of four. You can reuse them, but it is easier if you have at least eight to work with.",
      "ingredients": [
        "For the Ricotta Cream:",
        "2 pounds whole- or part-skim-milk ricotta",
        "1 1/2 cups confectioners' sugar",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon ground cinnamon",
        "1 ounce semisweet chocolate, chopped",
        "2 tablespoons chopped candied orange peel",
        "1/4 cup shelled pistachios"
      ],
      "sub_recipes": [
        {
          "name": "For all-purpose flour",
          "ingredients": [
            "2 cups all-purpose flour",
            "1 tablespoon granulated sugar",
            "1/2 teaspoon salt",
            "2 tablespoons olive oil",
            "About 1/2 cup dry white wine",
            "1 egg white, beaten",
            "Vegetable oil for deep-frying",
            "Candied cherries or crushed orange peel (optional)",
            "Confectioners' sugar"
          ]
        }
      ],
      "instructions": [
        "Line a large strainer with cheesecloth. Place the strainer over a bowl. Scrape the ricotta into the strainer and cover with a piece of plastic wrap and a small plate. Weight the plate with a heavy can. Let the ricotta drain in the refrigerator for several hours, or overnight.",
        "In a large bowl, whisk the ricotta until smooth. Stir in the confectioners' sugar, vanilla, and cinnamon, and salt. Stir in the oil and enough wine to make a soft dough. Turn the dough out onto a lightly floured surface and knead it until smooth and well blended, about 2 minutes. Shape the dough into a ball. Cover with plastic wrap and let rest at room temperature for at least 30 minutes.",
        "Cut the dough into 4 pieces. Starting at the middle setting, run one of the pieces of dough through the rollers of a pasta machine. Lightly dust the dough with flour as needed to keep the pieces from sticking together. Continue rolling the dough through progressively narrower settings until you have last setting. The dough strip should be about 4 inches wide and thin enough to see your hand through. [The dough can be rolled on a board with a rolling pin, but be sure to roll it very thin.] Measure the length of your cannoli tubes and cut the strip of dough crosswise into pieces about 1 inch shorter.",
        "Continue rolling out the remaining dough. Work do not have enough cannoli tubes for all of the pieces at once; simply cover the remaining dough with plastic wrap until you are ready to cook them.",
        "On the cannoli tubes. Place a cannoli tube on one piece of dough at an angle, from corner to corner. Fold the dough over to cover the tube. It should not be wrapped too tight or stretched too tight. The dough or pull it apart. Wet a little egg white on the dough where it overlaps; avoid getting egg white on the cannoli tube or it. Press the edges to seal.",
        "Pour 2 inches of oil into a deep fryer or deep heavy saucepan. Heat to 375°F on a deep-frying thermometer. Line a baking pan with paper towels. Carefully lower a few of the cannoli tubes into the hot oil. Do not crowd the pan. Fry the shells until golden, about 2 minutes, turning them so that they brown evenly.",
        "Using tongs, remove the cannoli tubes, holding them straight up so that the oil flows back into the pan. Drain the tubes briefly on the paper towels.",
        "While they are still hot, carefully slide the cannoli shells from the tubes. Grasp each tube with a pot holder and pull the cannoli shell off the tube with a pair of tongs, or with your hand protected by an oven mitt or towel. Cool the shells completely on the paper towels.",
        "The shells are fragile and break easily, so handle them carefully. (Cooked shells can be stored in an airtight container, up to 3 days.) Repeat until all the shells are cooked.",
        "To make the ricotta cream, put the ricotta in a food processor and blend it until creamy. Add the confectioners' sugar, vanilla, and cinnamon and blend until smooth. Transfer to a bowl and stir in the chocolate chips and candied fruit. Cover and refrigerate up to 2 days. (The filling will keep in the refrigerator.)",
        "To assemble, fill a pastry bag fitted with a 1/2-inch plain tip, or a heavy-duty plastic storage bag, with the ricotta cream. If using a plastic bag, cut about 1/2 inch off one bottom corner. Insert the tip of the bag in a cannoli shell and squeeze gently until the shell is half-filled. Turn the shell and fill from the other side. The shell should be completely filled but not overstuffed. If the ricotta mixture is too stiff, decorate the ends with candied cherries or strips of orange peel.",
        "Place the cannoli on a serving platter and sprinkle with confectioners' sugar. Serve within 1 hour."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:48:17_screenshot.png",
      "source_images": [
        "15:47:52_screenshot.png"
      ]
    },
    {
      "name": "Biscotti d'Anice",
      "is_complete": true,
      "is_continuation": false,
      "meal_type": "any",
      "dish_role": "main",
      "serves": "Makes about 4 dozen",
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "description": "Biscotti Anise Cookies",
      "ingredients": [
        "2 large eggs at room temperature",
        "2 teaspoons anise extract",
        "1 teaspoon vanilla extract",
        "1 cup sugar",
        "1 cup all-purpose flour",
        "2 tablespoons cornstarch",
        "1 teaspoon baking powder",
        "1 teaspoon anise seeds"
      ],
      "sub_recipes": [],
      "instructions": [
        "Preheat the oven to 350°F. Butter a 9-inch square baking pan. Line the bottom of the pan with wax paper. Butter and flour the paper. Tap out the excess.",
        "In a large bowl, whisk the eggs until foamy. Whisk in the extracts, and sugar. With the whisk attachment or beaters, begin beating the eggs on low speed, gradually increasing the speed to high and continue to whip the eggs for 8 to 7 minutes, until they are very light and foamy and tripled in volume.",
        "Place the flour, cornstarch, and baking powder in a sieve. Shake about one-third of the mixture over the egg mixture. Gently but thoroughly fold in the dry ingredients. Repeat two more times with the remaining flour mixture. Fold in the anise seeds.",
        "Scrape the batter into the prepared pan, leveling the top with a rubber spatula. Bake for 20 to 25 minutes, until the top is evenly browned and firm when touched lightly in the center.",
        "Remove the cake from the oven and run a small knife around the sides. Invert the cake onto a cutting board and peel off the paper.",
        "With a long serrated knife, cut the cake into 3 strips. Cut each strip into 1/4-inch-thick slices. Place the slices on a large baking sheet.",
        "Bake the slices for 5 to 10 minutes, or until toasted and golden. Remove them from the oven and let cool on a wire rack. Store in a tightly covered container in a cool, dry place."
      ],
      "tips": [],
      "nutrition_full": null,
      "source_image": "15:48:17_screenshot.png"
    },
    {
      "name": "Cassata",
      "meal_type": "any",
      "dish_role": "main",
      "serves": null,
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "ingredients": [
        "1 pound whole- or part-skim-milk ricotta",
        "1/3 cup confectioners' sugar",
        "1 teaspoon vanilla extract",
        "2 ounces bittersweet or semisweet chocolate, chopped",
        "1/2 cup chopped candied fruit, such as citron or orange peel"
      ],
      "sub_recipes": [
        {
          "name": "For the Sponge Cake",
          "ingredients": [
            "6 large eggs, at room temperature",
            "3/4 cup sugar",
            "1 teaspoon vanilla extract",
            "1 cup sifted all-purpose flour",
            "4 ounces almond paste",
            "Green and red food coloring"
          ]
        },
        {
          "name": "For the Icing",
          "ingredients": [
            "2 large egg whites",
            "1/4 teaspoon grated lemon zest",
            "1 tablespoon fresh lemon juice",
            "1 1/2 cups confectioners' sugar",
            "Candied or dried fruit, such as cherries, pineapple, or oranges"
          ]
        }
      ],
      "instructions": [
        "To make the filling, line a large strainer with cheesecloth and place it over a bowl. Scrape the ricotta into the sieve and cover with plastic wrap. Place a plate on top of the ricotta and a heavy object such as a can on the plate. Refrigerate overnight to drain the ricotta.",
        "Beat the ricotta, confectioners' sugar, and vanilla in the bowl of an electric mixer until smooth and creamy. Fold in the chocolate and chopped candied fruit. (The filling can be made up to 24 hours ahead. Cover and refrigerate.)",
        "To make the sponge cake, preheat the oven to 375°F. Butter two 9-inch layer cake pans. Line the bottoms with parchment paper or waxed paper or parchment paper. Butter the paper. Dust the pans with flour and tap out the excess."
      ],
      "tips": [],
      "source_image": "15:48:37_screenshot.png"
    },
    {
      "name": "Sfogliatelle",
      "meal_type": "any",
      "dish_role": "main",
      "serves": "makes twelve 1/2-inch slices",
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null,
      "dietary_info": [],
      "ingredients": [
        "3 cups unbleached all-purpose flour",
        "1 teaspoon salt",
        "1/4 cup solid vegetable shortening or lard",
        "4 tablespoons unsalted butter",
        "1 large egg",
        "About 2/3 cup water",
        "1/2 cup of bleached flour",
        "water, sugar, and semolina",
        "ricotta, egg, vanilla, salt, and cinnamon",
        "confectioners' sugar"
      ],
      "sub_recipes": [
        {
          "name": "For the Filling",
          "ingredients": [
            "1 cup water",
            "1/4 cup sugar",
            "1/2 cup regular semolina or Cream of Wheat cereal",
            "1 cup ricotta",
            "1 large egg, beaten",
            "1 teaspoon vanilla extract",
            "1 teaspoon grated orange zest",
            "1/4 teaspoon ground cinnamon",
            "1/4 cup chopped candied citron or candied orange peel"
          ]
        },
        {
          "name": "To Assemble",
          "ingredients": [
            "1/2 cup solid vegetable shortening or lard",
            "4 tablespoons unsalted butter",
            "Confectioners' sugar"
          ]
        },
        {
          "name": "Makes 12",
          "ingredients": [
            "3 cups unbleached all-purpose flour",
            "1 teaspoon salt",
            "1/4 cup solid vegetable shortening or lard",
            "4 tablespoons unsalted butter",
            "1 cup water",
            "About 2/3 cup water"
          ]
        },
        {
          "name": "For the Filling",
          "ingredients": [
            "1 cup water",
            "1/4 cup sugar",
            "1/2 cup fine semolina or Cream of Wheat cereal",
            "1 cup ricotta",
            "1 large egg, beaten",
            "1 teaspoon vanilla extract",
            "1 teaspoon grated orange zest",
            "1/4 teaspoon ground cinnamon",
            "1/4 cup chopped candied citron or candied orange peel"
          ]
        },
        {
          "name": "To Assemble",
          "ingredients": [
            "1/2 cup solid vegetable shortening or lard",
            "4 tablespoons unsalted butter",
            "Confectioners' sugar"
          ]
        }
      ],
      "instructions": [
        "To make the dough, put the flour and salt in a food processor, add the shortening and butter and pulse until the mixture resembles coarse crumbs. With the machine running, add the honey and",
        "To make the dough, put the flour and salt in a food processor, add the shortening and butter and pulse until the mixture resembles coarse crumbs. With the machine running, add the honey and",
        "About 1/2 cup of bleached flour (all-purpose flour works good) and then you sprinkle the dough, kneading it together with a ball. Transfer the dough to a lightly floured surface. Knead the dough for 8 minutes, until it is soft. Flatten the dough into a disk and wrap it in plastic. Refrigerate for at least 1 hour, or overnight.",
        "To make the filling, stir together the water, sugar, and semolina in a medium saucepan. Place this pan over a heated heat and simmer, stirring constantly. Cook for 5 minutes, or until the mixture thickens. Remove from the heat.",
        "Stir in the ricotta, egg, vanilla, salt, and cinnamon. Mix in the candied citron. Cover and refrigerate until ready to use.",
        "To shape the sfogliatelle, work the shortening and butter in a small saucepan.",
        "On a lightly floured work surface. Place your piece on a lightly floured surface. Keep the remaining dough covered while you work. With a rolling pin, roll the dough out into a rectangle at least 24 inches long and 6 inches wide. Set the strip of dough aside while you roll out the remaining pieces in the same way.",
        "Brush one long edge of dough with the melted shortening and butter. Place a second strip on top and repeat with more brushing. Stack and brush the remaining pieces in the same way.",
        "Beginning at one of the narrow ends, tightly roll up the stack of dough into a log. Wrap in plastic wrap and refrigerate for at least one hour, or until firm. Cover the remaining shortening mixture and refrigerate.",
        "Preheat the oven to 400°F. Line two large baking sheets with foil.",
        "Cut the ends of the rolled-up dough to even them. Cut the dough into twelve 1/2-inch slices.",
        "Place one slice cut side down on a lightly floured surface. Center a rolling pin on the slice and roll first to the top, then to the bottom until the dough is thin. Place about a tablespoonful of the filling to one side of the center. Fold the dough over and press the edges lightly to seal. Place the sfogliatelle on the prepared baking sheet. Continue making the remaining sfogliatelle in the same way.",
        "Bake the sfogliatelle, switching the position of the baking sheets halfway through, for 20 minutes, brushing two more times with the shortening, until the pastries are golden and crisp.",
        "Slide the sfogliatelle onto a rack to cool slightly; sprinkle with confectioners' sugar before serving."
      ],
      "tips": [
        "Note: sfogliatelle are best served warm. If making them ahead, let them cool completely, then refrigerate or freeze them tightly wrapped in plastic. Reheat in a 400°F oven for 10 minutes."
      ],
      "source_image": "15:48:37_screenshot.png",
      "is_complete": true,
      "is_continuation": false,
      "source_images": [
        "15:48:37_screenshot.png",
        "15:48:37_screenshot.png",
        "15:48:52_screenshot.png"
      ],
      "merged_from_sources": [
        "15:48:37_screenshot.png",
        "15:48:52_screenshot.png"
      ],
      "cook_time": "10 minutes"
    }
  ],
  "processing_log": [
    {
      "file": "15:34:10_screenshot.png",
      "page_type": "article",
      "page_numbers": [
        14,
        15
      ],
      "classification": {
        "type": "article",
        "has_recipe_start": false,
        "has_recipe_continuation": false,
        "recipe_names_visible": [],
        "page_numbers": [
          14,
          15
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "status": "skipped - article"
    },
    {
      "file": "15:34:21_screenshot.png",
      "page_type": "article",
      "page_numbers": [],
      "classification": {
        "type": "article",
        "has_recipe_start": false,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Marinara Sauce"
        ],
        "page_numbers": [],
        "total_pages": null,
        "confidence": "high"
      },
      "status": "skipped - article"
    },
    {
      "file": "15:34:29_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        92,
        93
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Sunday Gravy",
          "Lasagne",
          "Bistecca Pizzaiola"
        ],
        "page_numbers": [
          92,
          93
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Sunday Gravy",
        "Lasagne",
        "Bistecca Pizzaiola"
      ],
      "has_continuation": false
    },
    {
      "file": "15:34:40_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        26,
        27,
        28
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Linguine alle Vongole",
          "Polpetti in Salsa di Pomodoro",
          "Braciole"
        ],
        "page_numbers": [
          26,
          27,
          28
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Linguine alle Vongole",
        "Polpetti in Salsa di Pomodoro"
      ],
      "has_continuation": true
    },
    {
      "file": "15:35:05_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        30,
        32,
        210
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": true,
        "recipe_names_visible": [
          "Struffoli"
        ],
        "page_numbers": [
          30,
          32,
          210
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Struffoli"
      ],
      "has_continuation": true
    },
    {
      "file": "15:35:15_screenshot.png",
      "page_type": "article",
      "page_numbers": [
        33,
        35
      ],
      "classification": {
        "type": "article",
        "has_recipe_start": false,
        "has_recipe_continuation": false,
        "recipe_names_visible": [],
        "page_numbers": [
          33,
          35
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "status": "skipped - article"
    },
    {
      "file": "15:35:27_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        38,
        39
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Pasta Fagioli",
          "Baccalà Pizzaiola",
          "Pasta e Patate"
        ],
        "page_numbers": [
          38,
          39
        ],
        "total_pages": 270,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Pasta Fagioli",
        "Baccalà Pizzaiola"
      ],
      "has_continuation": true
    },
    {
      "file": "15:35:51_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        41,
        43
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Rigatoni with Broccoli",
          "Panzerotti",
          "Giambotta"
        ],
        "page_numbers": [
          41,
          43
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Rigatoni with Broccoli",
        "Panzerotti"
      ],
      "has_continuation": true
    },
    {
      "file": "15:36:07_screenshot.png",
      "page_type": "photo",
      "page_numbers": [],
      "classification": {
        "type": "photo",
        "has_recipe_start": false,
        "has_recipe_continuation": false,
        "recipe_names_visible": [],
        "page_numbers": [],
        "total_pages": null,
        "confidence": "high"
      },
      "status": "skipped - photo"
    },
    {
      "file": "15:36:22_screenshot.png",
      "page_type": "article",
      "page_numbers": [
        47,
        48
      ],
      "classification": {
        "type": "article",
        "has_recipe_start": false,
        "has_recipe_continuation": false,
        "recipe_names_visible": [],
        "page_numbers": [
          47,
          48
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "status": "skipped - article"
    },
    {
      "file": "15:36:42_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        50,
        51,
        52
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Janice's Vegetarian Baked Ziti",
          "Livia's Fried Mushrooms"
        ],
        "page_numbers": [
          50,
          51,
          52
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Janice's Vegetarian Baked Ziti"
      ],
      "has_continuation": true
    },
    {
      "file": "15:37:04_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        54,
        55,
        210
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Chicken Soup With Orzo",
          "Roasted Pepper Salad",
          "Standing Rib Roast",
          "Roast pork Shoulder"
        ],
        "page_numbers": [
          54,
          55,
          210
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Chicken Soup With Orzo",
        "Roasted Pepper Salad",
        "Roast pork Shoulder",
        "Standing Rib Roast"
      ],
      "has_continuation": false
    },
    {
      "file": "15:37:28_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        58,
        59,
        210
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Manicotti",
          "Amaretti",
          "Cavatelli",
          "Biscotti Regina"
        ],
        "page_numbers": [
          58,
          59,
          210
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Manicotti",
        "Amaretti",
        "Biscotti Regina",
        "Cavatelli"
      ],
      "has_continuation": false
    },
    {
      "file": "15:37:38_screenshot.png",
      "page_type": "recipe_partial",
      "page_numbers": [
        62,
        63
      ],
      "classification": {
        "type": "recipe_partial",
        "has_recipe_start": false,
        "has_recipe_continuation": true,
        "recipe_names_visible": [],
        "page_numbers": [
          62,
          63
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Biscotti"
      ],
      "has_continuation": false
    },
    {
      "file": "15:37:47_screenshot.png",
      "page_type": "article",
      "page_numbers": [
        66,
        67
      ],
      "classification": {
        "type": "article",
        "has_recipe_start": false,
        "has_recipe_continuation": false,
        "recipe_names_visible": [],
        "page_numbers": [
          66,
          67
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "status": "skipped - article"
    },
    {
      "file": "15:37:57_screenshot.png",
      "page_type": "article",
      "page_numbers": [
        68,
        69,
        210
      ],
      "classification": {
        "type": "article",
        "has_recipe_start": false,
        "has_recipe_continuation": false,
        "recipe_names_visible": [],
        "page_numbers": [
          68,
          69,
          210
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "status": "skipped - article"
    },
    {
      "file": "15:38:13_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        72,
        73
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Ricotta-Pineapple Pie",
          "Minestra"
        ],
        "page_numbers": [
          72,
          73
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Ricotta-Pineapple Pie",
        "Minestra"
      ],
      "has_continuation": false
    },
    {
      "file": "15:38:20_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Rigatoni with Sweet Sausage and Tomato Sauce",
          "Scaerole with Garlic",
          "Ziti al Forno"
        ],
        "page_numbers": [],
        "total_pages": null,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Rigatoni with Sweet Sausage and Tomato Sauce",
        "Scarole with Garlic"
      ],
      "has_continuation": true
    },
    {
      "file": "15:38:28_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        79,
        81
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Baked Chicken with Potatoes, Lemon, and Oregano",
          "Mom's Pear and Grappa Pound Cake",
          "Pastina with Ricotta"
        ],
        "page_numbers": [
          79,
          81
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Baked Chicken with Potatoes, Lemon, and Oregano",
        "Mom's Pear and Grappa Pound Cake"
      ],
      "has_continuation": true
    },
    {
      "file": "15:38:38_screenshot.png",
      "page_type": "photo",
      "page_numbers": [
        83,
        210
      ],
      "classification": {
        "type": "photo",
        "has_recipe_start": false,
        "has_recipe_continuation": false,
        "recipe_names_visible": [],
        "page_numbers": [
          83,
          210
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "status": "skipped - photo"
    },
    {
      "file": "15:39:03_screenshot.png",
      "page_type": "article",
      "page_numbers": [
        84,
        85
      ],
      "classification": {
        "type": "article",
        "has_recipe_start": false,
        "has_recipe_continuation": false,
        "recipe_names_visible": [],
        "page_numbers": [
          84,
          85
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "status": "skipped - article"
    },
    {
      "file": "15:39:25_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        82,
        83
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Fettuccine Primavera",
          "Tortellini in Brodo",
          "Arancini"
        ],
        "page_numbers": [
          82,
          83
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Fettuccine Primavera",
        "Tortellini in Brodo"
      ],
      "has_continuation": true
    },
    {
      "file": "15:39:42_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        93,
        210
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": true,
        "recipe_names_visible": [
          "Ravioli alla Bacco",
          "Penne alla Vodka"
        ],
        "page_numbers": [
          93,
          210
        ],
        "total_pages": null,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Ravioli alla Bucco"
      ],
      "has_continuation": true
    },
    {
      "file": "15:40:05_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        95,
        97
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": true,
        "recipe_names_visible": [
          "Calamari Ripieni",
          "Osso Buco a la Bucco",
          "Quail Sinatra-Style"
        ],
        "page_numbers": [
          95,
          97
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Calamari Ripieni",
        "Osso Buco a la Bucco",
        "Quail Sinatra-Style"
      ],
      "has_continuation": false
    },
    {
      "file": "15:40:23_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        99,
        100
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": true,
        "recipe_names_visible": [
          "Chicken Francese",
          "Chicken Scarpariello",
          "Pasta all' Amatriciana"
        ],
        "page_numbers": [
          99,
          100
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Chicken Scarpariello",
        "Chicken Francese"
      ],
      "has_continuation": true
    },
    {
      "file": "15:40:51_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        92,
        210
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Chicken Francese",
          "Chicken Scarpariello",
          "Pasta all' Amatriciana"
        ],
        "page_numbers": [
          92,
          210
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Chicken Scarpariello",
        "Chicken Francese"
      ],
      "has_continuation": true
    },
    {
      "file": "15:41:09_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        104,
        105,
        210
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Fiori di Zucca Fritti",
          "Veal Piccata with Capers"
        ],
        "page_numbers": [
          104,
          105,
          210
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Fiori di Zucca Fritti"
      ],
      "has_continuation": true
    },
    {
      "file": "15:41:20_screenshot.png",
      "page_type": "article",
      "page_numbers": [
        108,
        109
      ],
      "classification": {
        "type": "article",
        "has_recipe_start": false,
        "has_recipe_continuation": false,
        "recipe_names_visible": [],
        "page_numbers": [
          108,
          109
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "status": "skipped - article"
    },
    {
      "file": "15:41:41_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        111,
        113,
        210
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Pollo Cacciatore al Forno",
          "Ah Beetz'",
          "Stincini"
        ],
        "page_numbers": [
          111,
          113,
          210
        ],
        "total_pages": null,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Pollo Cacciatore al Forno",
        "Ah Beetz'",
        "Stincini"
      ],
      "has_continuation": false
    },
    {
      "file": "15:41:48_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        118,
        119
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Roasted Sausages, Peppers, Potatoes, and Onions",
          "Eggplant Parmigiana"
        ],
        "page_numbers": [
          118,
          119
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Roasted Sausages, Peppers, Potatoes, and Onions",
        "Eggplant Parmigiana"
      ],
      "has_continuation": false
    },
    {
      "file": "15:42:03_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        130,
        131,
        210
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Caesar Salad",
          "Insalata di Mare",
          "Almond Torte"
        ],
        "page_numbers": [
          130,
          131,
          210
        ],
        "total_pages": null,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Caesar Salad",
        "Insalata di Mare",
        "Almond Torte"
      ],
      "has_continuation": false
    },
    {
      "file": "15:42:29_screenshot.png",
      "page_type": "photo",
      "page_numbers": [
        194,
        195
      ],
      "classification": {
        "type": "photo",
        "has_recipe_start": false,
        "has_recipe_continuation": false,
        "recipe_names_visible": [],
        "page_numbers": [
          194,
          195
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "status": "skipped - photo"
    },
    {
      "file": "15:42:40_screenshot.png",
      "page_type": "article",
      "page_numbers": [
        126,
        127,
        210
      ],
      "classification": {
        "type": "article",
        "has_recipe_start": false,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Last Meal"
        ],
        "page_numbers": [
          126,
          127,
          210
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "status": "skipped - article"
    },
    {
      "file": "15:42:54_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        129,
        131,
        210
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Chicken with Parsley Crumbs",
          "Melfi's Minestrone",
          "Tuna Salad with Green Beans and Tomatoes",
          "Zuppa di Cozze"
        ],
        "page_numbers": [
          129,
          131,
          210
        ],
        "total_pages": null,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Chicken with Parsley Crumbs",
        "Melfi's Minestrone",
        "Tuna Salad with Green Beans and Tomatoes",
        "Zuppa di Cozze"
      ],
      "has_continuation": false
    },
    {
      "file": "15:43:18_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        135,
        270
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Orange and Fennel Salad",
          "Arugula and Parmesan Salad",
          "Salmon Steaks with Avocado Salsa",
          "Scamalli in Hot Sauce",
          "Spaghetti Puttanesca"
        ],
        "page_numbers": [
          135,
          270
        ],
        "total_pages": 270,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Orange and Fennel Salad",
        "Arugula and Parmesan Salad",
        "Salmon Steaks with Avocado Salsa",
        "Scamalli in Hot Sauce",
        "Spaghetti Puttanesca"
      ],
      "has_continuation": false
    },
    {
      "file": "15:43:37_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        197,
        198
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Linguine Aglio Olio",
          "Calamari Fritti",
          "Lobster Fra Diavolo",
          "Pears al Vino Bianco"
        ],
        "page_numbers": [
          197,
          198
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Linguine Aglio Olio",
        "Calamari Fritti",
        "Lobster Fra Diavolo",
        "Pears al Vino Bianco"
      ],
      "has_continuation": false
    },
    {
      "file": "15:44:02_screenshot.png",
      "page_type": "recipe_partial",
      "page_numbers": [],
      "classification": {
        "type": "recipe_partial",
        "has_recipe_start": false,
        "has_recipe_continuation": true,
        "recipe_names_visible": [],
        "page_numbers": [],
        "total_pages": null,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Vanilla Bean"
      ],
      "has_continuation": false
    },
    {
      "file": "15:44:10_screenshot.png",
      "page_type": "article",
      "page_numbers": [
        144,
        145
      ],
      "classification": {
        "type": "article",
        "has_recipe_start": false,
        "has_recipe_continuation": false,
        "recipe_names_visible": [],
        "page_numbers": [
          144,
          145
        ],
        "total_pages": 270,
        "confidence": "high"
      },
      "status": "skipped - article"
    },
    {
      "file": "15:44:33_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        147,
        149,
        270
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "How to Cut a Garlic",
          "Zuppa di Scarole e Fagioli",
          "Carciofi Ripieni"
        ],
        "page_numbers": [
          147,
          149,
          270
        ],
        "total_pages": 270,
        "confidence": "high"
      },
      "recipes_extracted": [
        "How to Cut a Garlic",
        "Zuppa di Scarola e Fagioli"
      ],
      "has_continuation": true
    },
    {
      "file": "15:44:50_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        161,
        163,
        210
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": true,
        "recipe_names_visible": [
          "Uova in Purgatorio",
          "Pork Chops with Vinegar Peppers",
          "Potatoes and Eggs Sandwiches",
          "Peppers and Eggs Sandwiches"
        ],
        "page_numbers": [
          161,
          163,
          210
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Uova in Purgatorio",
        "Pork Chops with Vinegar Peppers",
        "Potatoes and Eggs Sandwiches",
        "Peppers and Eggs Sandwiches"
      ],
      "has_continuation": false
    },
    {
      "file": "15:45:02_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        155,
        156,
        157,
        158
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Fried Veal Cutlets",
          "Neapolitan-Style Stuffed Peppers"
        ],
        "page_numbers": [
          155,
          156,
          157,
          158
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Fried Veal Cutlets",
        "Neapolitan-Style Stuffed Peppers"
      ],
      "has_continuation": false
    },
    {
      "file": "15:45:14_screenshot.png",
      "page_type": "article",
      "page_numbers": [
        160,
        161
      ],
      "classification": {
        "type": "article",
        "has_recipe_start": false,
        "has_recipe_continuation": false,
        "recipe_names_visible": [],
        "page_numbers": [
          160,
          161
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "status": "skipped - article"
    },
    {
      "file": "15:45:32_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        164,
        165
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Risotto with Truffles and Champagne",
          "Filet Mignon with Red Wine Sauce",
          "Shrimp Scampi",
          "Linguine al Pesto"
        ],
        "page_numbers": [
          164,
          165
        ],
        "total_pages": 270,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Risotto with Truffles and Champagne",
        "Filet Mignon with Red Wine Sauce",
        "Shrimp Scampi"
      ],
      "has_continuation": true
    },
    {
      "file": "15:45:58_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        167,
        168
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Veal Scaloppine Marsala",
          "Zabaglione"
        ],
        "page_numbers": [
          167,
          168
        ],
        "total_pages": 270,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Veal Scaloppine Marsala"
      ],
      "has_continuation": true
    },
    {
      "file": "15:46:11_screenshot.png",
      "page_type": "article",
      "page_numbers": [
        172,
        173
      ],
      "classification": {
        "type": "article",
        "has_recipe_start": false,
        "has_recipe_continuation": false,
        "recipe_names_visible": [],
        "page_numbers": [
          172,
          173
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "status": "skipped - article"
    },
    {
      "file": "15:46:24_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        175,
        176,
        177
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Salsiccie alla Griglia",
          "Verdure alla Griglia",
          "Tonno alla Griglia"
        ],
        "page_numbers": [
          175,
          176,
          177
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Verdure alla Griglia",
        "Salsiccie alla Griglia",
        "Tonno alla Griglia"
      ],
      "has_continuation": false
    },
    {
      "file": "15:46:32_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        179,
        180
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Rollatine di Pesce Spada",
          "Spiedini",
          "Bistecca Fiorentina",
          "Balsamic Grilled Veal Chops"
        ],
        "page_numbers": [
          179,
          180
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Rollatine di Pesce Spada",
        "Spiedini",
        "Balsamic Grilled Veal Chops"
      ],
      "has_continuation": true
    },
    {
      "file": "15:46:44_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Grilled Spareribs"
        ],
        "page_numbers": [],
        "total_pages": null,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Grilled Spareribs"
      ],
      "has_continuation": false
    },
    {
      "file": "15:47:01_screenshot.png",
      "page_type": "article",
      "page_numbers": [
        186,
        187
      ],
      "classification": {
        "type": "article",
        "has_recipe_start": false,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "The Perfect Cannoli",
          "Tiramisu"
        ],
        "page_numbers": [
          186,
          187
        ],
        "total_pages": 270,
        "confidence": "high"
      },
      "status": "skipped - article"
    },
    {
      "file": "15:47:19_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        192,
        193,
        210
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Ricotta Cheesecake",
          "Torta Caprese",
          "Biscotti di Pinoli",
          "Baba au Rhum"
        ],
        "page_numbers": [
          192,
          193,
          210
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Ricotta Cheesecake",
        "Torta Caprese",
        "Biscotti di Pinoli",
        "Baba au Rhum"
      ],
      "has_continuation": false
    },
    {
      "file": "15:47:52_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        193,
        195,
        210
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": true,
        "recipe_names_visible": [
          "Mille Foglie",
          "Cannoli"
        ],
        "page_numbers": [
          193,
          195,
          210
        ],
        "total_pages": null,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Mille Foglie"
      ],
      "has_continuation": true
    },
    {
      "file": "15:48:17_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        197,
        198,
        199,
        210
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": true,
        "recipe_names_visible": [
          "Biscotti d'Anice",
          "Zeppole",
          "Tortoni"
        ],
        "page_numbers": [
          197,
          198,
          199,
          210
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Cannoli",
        "Biscotti d'Anice"
      ],
      "has_continuation": true
    },
    {
      "file": "15:48:37_screenshot.png",
      "page_type": "recipe",
      "page_numbers": [
        201,
        202
      ],
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Cassata",
          "Sfogliatelle"
        ],
        "page_numbers": [
          201,
          202
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Cassata",
        "Sfogliatelle"
      ],
      "has_continuation": false
    },
    {
      "file": "15:48:52_screenshot.png",
      "page_type": "recipe_partial",
      "page_numbers": [
        204,
        205,
        210
      ],
      "classification": {
        "type": "recipe_partial",
        "has_recipe_start": false,
        "has_recipe_continuation": true,
        "recipe_names_visible": [],
        "page_numbers": [
          204,
          205,
          210
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Stuffed Artichokes"
      ],
      "has_continuation": false
    },
    {
      "file": "15:49:04_screenshot.png",
      "page_type": "article",
      "page_numbers": [
        206,
        207,
        210
      ],
      "classification": {
        "type": "article",
        "has_recipe_start": false,
        "has_recipe_continuation": false,
        "recipe_names_visible": [],
        "page_numbers": [
          206,
          207,
          210
        ],
        "total_pages": null,
        "confidence": "high"
      },
      "status": "skipped - article"
    },
    {
      "file": "15:49:11_screenshot.png",
      "page_type": "article",
      "page_numbers": [
        208,
        209
      ],
      "classification": {
        "type": "article",
        "has_recipe_start": false,
        "has_recipe_continuation": false,
        "recipe_names_visible": [],
        "page_numbers": [
          208,
          209
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "status": "skipped - article"
    },
    {
      "file": "15:48:37_screenshot.png",
      "timestamp": "2025-11-30T19:29:50.677413",
      "page_type": "recipe",
      "classification": {
        "type": "recipe",
        "has_recipe_start": true,
        "has_recipe_continuation": false,
        "recipe_names_visible": [
          "Cassata",
          "Sfogliatelle"
        ],
        "page_numbers": [
          201,
          202,
          210
        ],
        "total_pages": 210,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Cassata",
        "Sfogliatelle"
      ]
    },
    {
      "file": "15:48:52_screenshot.png",
      "timestamp": "2025-11-30T19:29:50.677421",
      "page_type": "recipe_partial",
      "classification": {
        "type": "recipe_partial",
        "has_recipe_start": false,
        "has_recipe_continuation": true,
        "recipe_names_visible": [],
        "page_numbers": [
          204,
          205,
          210
        ],
        "total_pages": null,
        "confidence": "high"
      },
      "recipes_extracted": [
        "Sfogliatelle"
      ]
    }
  ],
  "index": {
    "by_name": {
      "Sunday Gravy": {
        "recipe_index": 0,
        "chapter": null,
        "serves": "Makes about 8 cups",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Lasagne": {
        "recipe_index": 1,
        "chapter": null,
        "serves": "Serves 8 to 10",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Bistecca Pizzaiola": {
        "recipe_index": 2,
        "chapter": null,
        "serves": "Serves 4",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Linguine alle Vongole": {
        "recipe_index": 3,
        "chapter": null,
        "serves": "6",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Polpetti in Salsa di Pomodoro": {
        "recipe_index": 4,
        "chapter": null,
        "serves": "6",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Struffoli": {
        "recipe_index": 5,
        "chapter": null,
        "serves": "12",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Pasta Fagioli": {
        "recipe_index": 6,
        "chapter": null,
        "serves": "8",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Baccalà Pizzaiola": {
        "recipe_index": 7,
        "chapter": null,
        "serves": "6 to 8",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Rigatoni with Broccoli": {
        "recipe_index": 8,
        "chapter": null,
        "serves": "4",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Panzerotti": {
        "recipe_index": 9,
        "chapter": null,
        "serves": "24",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Janice's Vegetarian Baked Ziti": {
        "recipe_index": 10,
        "chapter": null,
        "serves": "6 to 8",
        "dietary_info": [
          "VEGETARIAN"
        ],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Chicken Soup With Orzo": {
        "recipe_index": 11,
        "chapter": null,
        "serves": "6",
        "dietary_info": [],
        "calories": "",
        "protein": "",
        "prep_time": ""
      },
      "Roasted Pepper Salad": {
        "recipe_index": 12,
        "chapter": null,
        "serves": "8",
        "dietary_info": [],
        "calories": "",
        "protein": "",
        "prep_time": ""
      },
      "Roast pork Shoulder": {
        "recipe_index": 13,
        "chapter": null,
        "serves": "8 to 10",
        "dietary_info": [],
        "calories": "",
        "protein": "",
        "prep_time": ""
      },
      "Standing Rib Roast": {
        "recipe_index": 14,
        "chapter": null,
        "serves": "10",
        "dietary_info": [],
        "calories": "",
        "protein": "",
        "prep_time": ""
      },
      "Manicotti": {
        "recipe_index": 15,
        "chapter": null,
        "serves": "6 to 8",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Amaretti": {
        "recipe_index": 16,
        "chapter": null,
        "serves": null,
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Biscotti Regina": {
        "recipe_index": 17,
        "chapter": null,
        "serves": null,
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Cavatelli": {
        "recipe_index": 18,
        "chapter": null,
        "serves": "6 to 8",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Biscotti": {
        "recipe_index": 19,
        "chapter": null,
        "serves": null,
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Ricotta-Pineapple Pie": {
        "recipe_index": 20,
        "chapter": null,
        "serves": "8",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Minestra": {
        "recipe_index": 21,
        "chapter": null,
        "serves": "6",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Rigatoni with Sweet Sausage and Tomato Sauce": {
        "recipe_index": 22,
        "chapter": null,
        "serves": "6",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Scarole with Garlic": {
        "recipe_index": 23,
        "chapter": null,
        "serves": "4",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Baked Chicken with Potatoes, Lemon, and Oregano": {
        "recipe_index": 24,
        "chapter": null,
        "serves": "4",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Mom's Pear and Grappa Pound Cake": {
        "recipe_index": 25,
        "chapter": null,
        "serves": "12",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Fettuccine Primavera": {
        "recipe_index": 26,
        "chapter": null,
        "serves": "6",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Tortellini in Brodo": {
        "recipe_index": 27,
        "chapter": null,
        "serves": "8",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Ravioli alla Bucco": {
        "recipe_index": 28,
        "chapter": null,
        "serves": "8",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Calamari Ripieni": {
        "recipe_index": 29,
        "chapter": null,
        "serves": "6 to 8",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Osso Buco a la Bucco": {
        "recipe_index": 30,
        "chapter": null,
        "serves": "4",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Quail Sinatra-Style": {
        "recipe_index": 31,
        "chapter": null,
        "serves": "4 to 6",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Chicken Scarpariello": {
        "recipe_index": 34,
        "chapter": null,
        "serves": "6",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Chicken Francese": {
        "recipe_index": 35,
        "chapter": null,
        "serves": "4",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Fiori di Zucca Fritti": {
        "recipe_index": 36,
        "chapter": null,
        "serves": "4",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Pollo Cacciatore al Forno": {
        "recipe_index": 37,
        "chapter": null,
        "serves": "4-50",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Ah Beetz'": {
        "recipe_index": 38,
        "chapter": null,
        "serves": "1 pizza (8-10) or 6 pizzas (50)",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Stincini": {
        "recipe_index": 39,
        "chapter": null,
        "serves": "1 pizza (10) or 5 pizzas (50)",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Roasted Sausages, Peppers, Potatoes, and Onions": {
        "recipe_index": 40,
        "chapter": null,
        "serves": "4-50",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Eggplant Parmigiana": {
        "recipe_index": 41,
        "chapter": null,
        "serves": "6-50",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Caesar Salad": {
        "recipe_index": 42,
        "chapter": null,
        "serves": "6",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Insalata di Mare": {
        "recipe_index": 43,
        "chapter": null,
        "serves": "6",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Almond Torte": {
        "recipe_index": 44,
        "chapter": null,
        "serves": "8",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Chicken with Parsley Crumbs": {
        "recipe_index": 45,
        "chapter": null,
        "serves": "4",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Melfi's Minestrone": {
        "recipe_index": 46,
        "chapter": null,
        "serves": "2",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Tuna Salad with Green Beans and Tomatoes": {
        "recipe_index": 47,
        "chapter": null,
        "serves": "2",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Zuppa di Cozze": {
        "recipe_index": 48,
        "chapter": null,
        "serves": "4",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Orange and Fennel Salad": {
        "recipe_index": 49,
        "chapter": null,
        "serves": 4,
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Arugula and Parmesan Salad": {
        "recipe_index": 50,
        "chapter": null,
        "serves": 2,
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Salmon Steaks with Avocado Salsa": {
        "recipe_index": 51,
        "chapter": null,
        "serves": 4,
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Scamalli in Hot Sauce": {
        "recipe_index": 52,
        "chapter": null,
        "serves": "4 to 6",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Spaghetti Puttanesca": {
        "recipe_index": 53,
        "chapter": null,
        "serves": "4 to 6",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Linguine Aglio Olio": {
        "recipe_index": 54,
        "chapter": null,
        "serves": "4",
        "dietary_info": [],
        "calories": "",
        "protein": "",
        "prep_time": ""
      },
      "Calamari Fritti": {
        "recipe_index": 55,
        "chapter": null,
        "serves": "6 to 8",
        "dietary_info": [],
        "calories": "",
        "protein": "",
        "prep_time": ""
      },
      "Lobster Fra Diavolo": {
        "recipe_index": 56,
        "chapter": null,
        "serves": "4 to 6",
        "dietary_info": [],
        "calories": "",
        "protein": "",
        "prep_time": ""
      },
      "Pears al Vino Bianco": {
        "recipe_index": 57,
        "chapter": null,
        "serves": "6",
        "dietary_info": [],
        "calories": "",
        "protein": "",
        "prep_time": ""
      },
      "Vanilla Bean": {
        "recipe_index": 58,
        "chapter": null,
        "serves": null,
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "How to Cut a Garlic": {
        "recipe_index": 59,
        "chapter": null,
        "serves": null,
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Zuppa di Scarola e Fagioli": {
        "recipe_index": 60,
        "chapter": null,
        "serves": "4",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Uova in Purgatorio": {
        "recipe_index": 61,
        "chapter": null,
        "serves": "4",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Pork Chops with Vinegar Peppers": {
        "recipe_index": 62,
        "chapter": null,
        "serves": "4",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Potatoes and Eggs Sandwiches": {
        "recipe_index": 63,
        "chapter": null,
        "serves": "4",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Peppers and Eggs Sandwiches": {
        "recipe_index": 64,
        "chapter": null,
        "serves": "4",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Fried Veal Cutlets": {
        "recipe_index": 65,
        "chapter": null,
        "serves": "4",
        "dietary_info": [],
        "calories": "",
        "protein": "",
        "prep_time": null
      },
      "Neapolitan-Style Stuffed Peppers": {
        "recipe_index": 66,
        "chapter": null,
        "serves": "6",
        "dietary_info": [],
        "calories": "",
        "protein": "",
        "prep_time": null
      },
      "Risotto with Truffles and Champagne": {
        "recipe_index": 67,
        "chapter": null,
        "serves": "2",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Filet Mignon with Red Wine Sauce": {
        "recipe_index": 68,
        "chapter": null,
        "serves": "2",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Shrimp Scampi": {
        "recipe_index": 69,
        "chapter": null,
        "serves": "2",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Veal Scaloppine Marsala": {
        "recipe_index": 70,
        "chapter": null,
        "serves": "2",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Verdure alla Griglia": {
        "recipe_index": 71,
        "chapter": null,
        "serves": "8",
        "dietary_info": [
          "VEGETARIAN"
        ],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Salsiccie alla Griglia": {
        "recipe_index": 72,
        "chapter": null,
        "serves": "6",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Tonno alla Griglia": {
        "recipe_index": 73,
        "chapter": null,
        "serves": "4",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Rollatine di Pesce Spada": {
        "recipe_index": 74,
        "chapter": null,
        "serves": "6",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Spiedini": {
        "recipe_index": 75,
        "chapter": null,
        "serves": "6",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Balsamic Grilled Veal Chops": {
        "recipe_index": 76,
        "chapter": null,
        "serves": "4",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Grilled Spareribs": {
        "recipe_index": 77,
        "chapter": null,
        "serves": "4",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Ricotta Cheesecake": {
        "recipe_index": 78,
        "chapter": null,
        "serves": "12",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Torta Caprese": {
        "recipe_index": 79,
        "chapter": null,
        "serves": "10",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Biscotti di Pinoli": {
        "recipe_index": 80,
        "chapter": null,
        "serves": "30",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Baba au Rhum": {
        "recipe_index": 81,
        "chapter": null,
        "serves": "8 to 10",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Mille Foglie": {
        "recipe_index": 82,
        "chapter": null,
        "serves": "8",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Cannoli": {
        "recipe_index": 83,
        "chapter": null,
        "serves": "16",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Biscotti d'Anice": {
        "recipe_index": 84,
        "chapter": null,
        "serves": "Makes about 4 dozen",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Cassata": {
        "recipe_index": 85,
        "chapter": null,
        "serves": null,
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      },
      "Sfogliatelle": {
        "recipe_index": 86,
        "chapter": null,
        "serves": "makes twelve 1/2-inch slices",
        "dietary_info": [],
        "calories": null,
        "protein": null,
        "prep_time": null
      }
    },
    "by_chapter": {
      "Unknown": [
        "Sunday Gravy",
        "Lasagne",
        "Bistecca Pizzaiola",
        "Linguine alle Vongole",
        "Polpetti in Salsa di Pomodoro",
        "Struffoli",
        "Pasta Fagioli",
        "Baccalà Pizzaiola",
        "Rigatoni with Broccoli",
        "Panzerotti",
        "Janice's Vegetarian Baked Ziti",
        "Chicken Soup With Orzo",
        "Roasted Pepper Salad",
        "Roast pork Shoulder",
        "Standing Rib Roast",
        "Manicotti",
        "Amaretti",
        "Biscotti Regina",
        "Cavatelli",
        "Biscotti",
        "Ricotta-Pineapple Pie",
        "Minestra",
        "Rigatoni with Sweet Sausage and Tomato Sauce",
        "Scarole with Garlic",
        "Baked Chicken with Potatoes, Lemon, and Oregano",
        "Mom's Pear and Grappa Pound Cake",
        "Fettuccine Primavera",
        "Tortellini in Brodo",
        "Ravioli alla Bucco",
        "Calamari Ripieni",
        "Osso Buco a la Bucco",
        "Quail Sinatra-Style",
        "Chicken Scarpariello",
        "Chicken Francese",
        "Chicken Scarpariello",
        "Chicken Francese",
        "Fiori di Zucca Fritti",
        "Pollo Cacciatore al Forno",
        "Ah Beetz'",
        "Stincini",
        "Roasted Sausages, Peppers, Potatoes, and Onions",
        "Eggplant Parmigiana",
        "Caesar Salad",
        "Insalata di Mare",
        "Almond Torte",
        "Chicken with Parsley Crumbs",
        "Melfi's Minestrone",
        "Tuna Salad with Green Beans and Tomatoes",
        "Zuppa di Cozze",
        "Orange and Fennel Salad",
        "Arugula and Parmesan Salad",
        "Salmon Steaks with Avocado Salsa",
        "Scamalli in Hot Sauce",
        "Spaghetti Puttanesca",
        "Linguine Aglio Olio",
        "Calamari Fritti",
        "Lobster Fra Diavolo",
        "Pears al Vino Bianco",
        "Vanilla Bean",
        "How to Cut a Garlic",
        "Zuppa di Scarola e Fagioli",
        "Uova in Purgatorio",
        "Pork Chops with Vinegar Peppers",
        "Potatoes and Eggs Sandwiches",
        "Peppers and Eggs Sandwiches",
        "Fried Veal Cutlets",
        "Neapolitan-Style Stuffed Peppers",
        "Risotto with Truffles and Champagne",
        "Filet Mignon with Red Wine Sauce",
        "Shrimp Scampi",
        "Veal Scaloppine Marsala",
        "Verdure alla Griglia",
        "Salsiccie alla Griglia",
        "Tonno alla Griglia",
        "Rollatine di Pesce Spada",
        "Spiedini",
        "Balsamic Grilled Veal Chops",
        "Grilled Spareribs",
        "Ricotta Cheesecake",
        "Torta Caprese",
        "Biscotti di Pinoli",
        "Baba au Rhum",
        "Mille Foglie",
        "Cannoli",
        "Biscotti d'Anice",
        "Cassata",
        "Sfogliatelle"
      ]
    },
    "all_recipes": [
      "Sunday Gravy",
      "Lasagne",
      "Bistecca Pizzaiola",
      "Linguine alle Vongole",
      "Polpetti in Salsa di Pomodoro",
      "Struffoli",
      "Pasta Fagioli",
      "Baccalà Pizzaiola",
      "Rigatoni with Broccoli",
      "Panzerotti",
      "Janice's Vegetarian Baked Ziti",
      "Chicken Soup With Orzo",
      "Roasted Pepper Salad",
      "Roast pork Shoulder",
      "Standing Rib Roast",
      "Manicotti",
      "Amaretti",
      "Biscotti Regina",
      "Cavatelli",
      "Biscotti",
      "Ricotta-Pineapple Pie",
      "Minestra",
      "Rigatoni with Sweet Sausage and Tomato Sauce",
      "Scarole with Garlic",
      "Baked Chicken with Potatoes, Lemon, and Oregano",
      "Mom's Pear and Grappa Pound Cake",
      "Fettuccine Primavera",
      "Tortellini in Brodo",
      "Ravioli alla Bucco",
      "Calamari Ripieni",
      "Osso Buco a la Bucco",
      "Quail Sinatra-Style",
      "Chicken Scarpariello",
      "Chicken Francese",
      "Chicken Scarpariello",
      "Chicken Francese",
      "Fiori di Zucca Fritti",
      "Pollo Cacciatore al Forno",
      "Ah Beetz'",
      "Stincini",
      "Roasted Sausages, Peppers, Potatoes, and Onions",
      "Eggplant Parmigiana",
      "Caesar Salad",
      "Insalata di Mare",
      "Almond Torte",
      "Chicken with Parsley Crumbs",
      "Melfi's Minestrone",
      "Tuna Salad with Green Beans and Tomatoes",
      "Zuppa di Cozze",
      "Orange and Fennel Salad",
      "Arugula and Parmesan Salad",
      "Salmon Steaks with Avocado Salsa",
      "Scamalli in Hot Sauce",
      "Spaghetti Puttanesca",
      "Linguine Aglio Olio",
      "Calamari Fritti",
      "Lobster Fra Diavolo",
      "Pears al Vino Bianco",
      "Vanilla Bean",
      "How to Cut a Garlic",
      "Zuppa di Scarola e Fagioli",
      "Uova in Purgatorio",
      "Pork Chops with Vinegar Peppers",
      "Potatoes and Eggs Sandwiches",
      "Peppers and Eggs Sandwiches",
      "Fried Veal Cutlets",
      "Neapolitan-Style Stuffed Peppers",
      "Risotto with Truffles and Champagne",
      "Filet Mignon with Red Wine Sauce",
      "Shrimp Scampi",
      "Veal Scaloppine Marsala",
      "Verdure alla Griglia",
      "Salsiccie alla Griglia",
      "Tonno alla Griglia",
      "Rollatine di Pesce Spada",
      "Spiedini",
      "Balsamic Grilled Veal Chops",
      "Grilled Spareribs",
      "Ricotta Cheesecake",
      "Torta Caprese",
      "Biscotti di Pinoli",
      "Baba au Rhum",
      "Mille Foglie",
      "Cannoli",
      "Biscotti d'Anice",
      "Cassata",
      "Sfogliatelle"
    ],
    "unmatched": [],
    "by_dietary": {
      "vegetarian": [
        "Janice's Vegetarian Baked Ziti",
        "Verdure alla Griglia"
      ]
    },
    "by_macros": {
      "high_protein": [],
      "low_carb": [],
      "low_calorie": []
    }
  },
  "deletion_log": [
    {
      "deleted": [
        "Stuffed Artichokes"
      ],
      "timestamp": "2025-11-30T19:26:45.652457"
    }
  ],
  "upsert_log": [
    {
      "action": "updated",
      "recipe_name": "Cassata",
      "source_image": "15:48:37_screenshot.png, 15:48:52_screenshot.png",
      "timestamp": "2025-11-30T19:29:50.676936",
      "previous_source": "15:48:37_screenshot.png"
    },
    {
      "action": "merged",
      "recipe_name": "Sfogliatelle",
      "source_image": "15:48:37_screenshot.png, 15:48:52_screenshot.png",
      "timestamp": "2025-11-30T19:29:50.676978",
      "previous_source": "15:48:37_screenshot.png",
      "note": "Merged: old had 6 ing/1 steps, new had 0 ing/1 steps"
    },
    {
      "action": "merged",
      "recipe_name": "Sfogliatelle",
      "source_image": "15:48:37_screenshot.png, 15:48:52_screenshot.png",
      "timestamp": "2025-11-30T19:29:50.676993",
      "previous_source": "15:48:37_screenshot.png",
      "note": "Merged: old had 6 ing/2 steps, new had 4 ing/12 steps"
    }
  ]
}